garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
extern volatile PORTWIN6bits_t PORTWIN6bits __at(0x108);
// bitfield macros
#define _PORTWIN6_IN_POSN                                   0x0
#define _PORTWIN6_IN_POSITION                               0x0
#define _PORTWIN6_IN_SIZE                                   0x8
#define _PORTWIN6_IN_LENGTH                                 0x8
#define _PORTWIN6_IN_MASK                                   0xFF
#define _PORTWIN6_IN0_POSN                                  0x0
#define _PORTWIN6_IN0_POSITION                              0x0
#define _PORTWIN6_IN0_SIZE                                  0x1
#define _PORTWIN6_IN0_LENGTH                                0x1
#define _PORTWIN6_IN0_MASK                                  0x1
#define _PORTWIN6_IN1_POSN                                  0x1
#define _PORTWIN6_IN1_POSITION                              0x1
#define _PORTWIN6_IN1_SIZE                                  0x1
#define _PORTWIN6_IN1_LENGTH                                0x1
#define _PORTWIN6_IN1_MASK                                  0x2
#define _PORTWIN6_IN2_POSN                                  0x2
#define _PORTWIN6_IN2_POSITION                              0x2
#define _PORTWIN6_IN2_SIZE                                  0x1
#define _PORTWIN6_IN2_LENGTH                                0x1
#define _PORTWIN6_IN2_MASK                                  0x4
#define _PORTWIN6_IN3_POSN                                  0x3
#define _PORTWIN6_IN3_POSITION                              0x3
#define _PORTWIN6_IN3_SIZE                                  0x1
#define _PORTWIN6_IN3_LENGTH                                0x1
#define _PORTWIN6_IN3_MASK                                  0x8

// Register: PORTWIN7
#define PORTWIN7 PORTWIN7
extern volatile unsigned char           PORTWIN7            __at(0x109);
#ifndef _LIB_BUILD
asm("PORTWIN7 equ 0109h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN7bits_t;
extern volatile PORTWIN7bits_t PORTWIN7bits __at(0x109);
// bitfield macros
#define _PORTWIN7_IN_POSN                                   0x0
#define _PORTWIN7_IN_POSITION                               0x0
#define _PORTWIN7_IN_SIZE                                   0x8
#define _PORTWIN7_IN_LENGTH                                 0x8
#define _PORTWIN7_IN_MASK                                   0xFF
#define _PORTWIN7_IN0_POSN                                  0x0
#define _PORTWIN7_IN0_POSITION                              0x0
#define _PORTWIN7_IN0_SIZE                                  0x1
#define _PORTWIN7_IN0_LENGTH                                0x1
#define _PORTWIN7_IN0_MASK                                  0x1
#define _PORTWIN7_IN1_POSN                                  0x1
#define _PORTWIN7_IN1_POSITION                              0x1
#define _PORTWIN7_IN1_SIZE                                  0x1
#define _PORTWIN7_IN1_LENGTH                                0x1
#define _PORTWIN7_IN1_MASK                                  0x2
#define _PORTWIN7_IN2_POSN                                  0x2
#define _PORTWIN7_IN2_POSITION                              0x2
#define _PORTWIN7_IN2_SIZE                                  0x1
#define _PORTWIN7_IN2_LENGTH                                0x1
#define _PORTWIN7_IN2_MASK                                  0x4
#define _PORTWIN7_IN3_POSN                                  0x3
#define _PORTWIN7_IN3_POSITION                              0x3
#define _PORTWIN7_IN3_SIZE                                  0x1
#define _PORTWIN7_IN3_LENGTH                                0x1
#define _PORTWIN7_IN3_MASK                                  0x8

// Register: PORTWCLK
#define PORTWCLK PORTWCLK
extern volatile unsigned char           PORTWCLK            __at(0x10A);
#ifndef _LIB_BUILD
asm("PORTWCLK equ 010Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned PWCLK                  :8;
    };
} PORTWCLKbits_t;
extern volatile PORTWCLKbits_t PORTWCLKbits __at(0x10A);
// bitfield macros
#define _PORTWCLK_CLK_POSN                                  0x0
#define _PORTWCLK_CLK_POSITION                              0x0
#define _PORTWCLK_CLK_SIZE                                  0x8
#define _PORTWCLK_CLK_LENGTH                                0x8
#define _PORTWCLK_CLK_MASK                                  0xFF
#define _PORTWCLK_CLK0_POSN                                 0x0
#define _PORTWCLK_CLK0_POSITION                             0x0
#define _PORTWCLK_CLK0_SIZE                                 0x1
#define _PORTWCLK_CLK0_LENGTH                               0x1
#define _PORTWCLK_CLK0_MASK                                 0x1
#define _PORTWCLK_CLK1_POSN                                 0x1
#define _PORTWCLK_CLK1_POSITION                             0x1
#define _PORTWCLK_CLK1_SIZE                                 0x1
#define _PORTWCLK_CLK1_LENGTH                               0x1
#define _PORTWCLK_CLK1_MASK                                 0x2
#define _PORTWCLK_CLK2_POSN                                 0x2
#define _PORTWCLK_CLK2_POSITION                             0x2
#define _PORTWCLK_CLK2_SIZE                                 0x1
#define _PORTWCLK_CLK2_LENGTH                               0x1
#define _PORTWCLK_CLK2_MASK                                 0x4
#define _PORTWCLK_CLK3_POSN                                 0x3
#define _PORTWCLK_CLK3_POSITION                             0x3
#define _PORTWCLK_CLK3_SIZE                                 0x1
#define _PORTWCLK_CLK3_LENGTH                               0x1
#define _PORTWCLK_CLK3_MASK                                 0x8
#define _PORTWCLK_CLK4_POSN                                 0x4
#define _PORTWCLK_CLK4_POSITION                             0x4
#define _PORTWCLK_CLK4_SIZE                                 0x1
#define _PORTWCLK_CLK4_LENGTH                               0x1
#define _PORTWCLK_CLK4_MASK                                 0x10
#define _PORTWCLK_PWCLK_POSN                                0x0
#define _PORTWCLK_PWCLK_POSITION                            0x0
#define _PORTWCLK_PWCLK_SIZE                                0x8
#define _PORTWCLK_PWCLK_LENGTH                              0x8
#define _PORTWCLK_PWCLK_MASK                                0xFF

// Register: PORTWDF
#define PORTWDF PORTWDF
extern volatile unsigned char           PORTWDF             __at(0x10B);
#ifndef _LIB_BUILD
asm("PORTWDF equ 010Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DF0                    :1;
        unsigned DF1                    :1;
        unsigned DF2                    :1;
        unsigned DF3                    :1;
        unsigned DF4                    :1;
        unsigned DF5                    :1;
        unsigned DF6                    :1;
        unsigned DF7                    :1;
    };
    struct {
        unsigned PWDF0                  :1;
        unsigned PWDF1                  :1;
        unsigned PWDF2                  :1;
        unsigned PWDF3                  :1;
        unsigned PWDF4                  :1;
        unsigned PWDF5                  :1;
        unsigned PWDF6                  :1;
        unsigned PWDF7                  :1;
    };
    struct {
        unsigned DF                     :8;
    };
    struct {
        unsigned PWDF                   :8;
    };
} PORTWDFbits_t;
extern volatile PORTWDFbits_t PORTWDFbits __at(0x10B);
// bitfield macros
#define _PORTWDF_DF0_POSN                                   0x0
#define _PORTWDF_DF0_POSITION                               0x0
#define _PORTWDF_DF0_SIZE                                   0x1
#define _PORTWDF_DF0_LENGTH                                 0x1
#define _PORTWDF_DF0_MASK                                   0x1
#define _PORTWDF_DF1_POSN                                   0x1
#define _PORTWDF_DF1_POSITION                               0x1
#define _PORTWDF_DF1_SIZE                                   0x1
#define _PORTWDF_DF1_LENGTH                                 0x1
#define _PORTWDF_DF1_MASK                                   0x2
#define _PORTWDF_DF2_POSN                                   0x2
#define _PORTWDF_DF2_POSITION                               0x2
#define _PORTWDF_DF2_SIZE                                   0x1
#define _PORTWDF_DF2_LENGTH                                 0x1
#define _PORTWDF_DF2_MASK                                   0x4
#define _PORTWDF_DF3_POSN                                   0x3
#define _PORTWDF_DF3_POSITION                               0x3
#define _PORTWDF_DF3_SIZE                                   0x1
#define _PORTWDF_DF3_LENGTH                                 0x1
#define _PORTWDF_DF3_MASK                                   0x8
#define _PORTWDF_DF4_POSN                                   0x4
#define _PORTWDF_DF4_POSITION                               0x4
#define _PORTWDF_DF4_SIZE                                   0x1
#define _PORTWDF_DF4_LENGTH                                 0x1
#define _PORTWDF_DF4_MASK                                   0x10
#define _PORTWDF_DF5_POSN                                   0x5
#define _PORTWDF_DF5_POSITION                               0x5
#define _PORTWDF_DF5_SIZE                                   0x1
#define _PORTWDF_DF5_LENGTH                                 0x1
#define _PORTWDF_DF5_MASK                                   0x20
#define _PORTWDF_DF6_POSN                                   0x6
#define _PORTWDF_DF6_POSITION                               0x6
#define _PORTWDF_DF6_SIZE                                   0x1
#define _PORTWDF_DF6_LENGTH                                 0x1
#define _PORTWDF_DF6_MASK                                   0x40
#define _PORTWDF_DF7_POSN                                   0x7
#define _PORTWDF_DF7_POSITION                               0x7
#define _PORTWDF_DF7_SIZE                                   0x1
#define _PORTWDF_DF7_LENGTH                                 0x1
#define _PORTWDF_DF7_MASK                                   0x80
#define _PORTWDF_PWDF0_POSN                                 0x0
#define _PORTWDF_PWDF0_POSITION                             0x0
#define _PORTWDF_PWDF0_SIZE                                 0x1
#define _PORTWDF_PWDF0_LENGTH                               0x1
#define _PORTWDF_PWDF0_MASK                                 0x1
#define _PORTWDF_PWDF1_POSN                                 0x1
#define _PORTWDF_PWDF1_POSITION                             0x1
#define _PORTWDF_PWDF1_SIZE                                 0x1
#define _PORTWDF_PWDF1_LENGTH                               0x1
#define _PORTWDF_PWDF1_MASK                                 0x2
#define _PORTWDF_PWDF2_POSN                                 0x2
#define _PORTWDF_PWDF2_POSITION                             0x2
#define _PORTWDF_PWDF2_SIZE                                 0x1
#define _PORTWDF_PWDF2_LENGTH                               0x1
#define _PORTWDF_PWDF2_MASK                                 0x4
#define _PORTWDF_PWDF3_POSN                                 0x3
#define _PORTWDF_PWDF3_POSITION                             0x3
#define _PORTWDF_PWDF3_SIZE                                 0x1
#define _PORTWDF_PWDF3_LENGTH                               0x1
#define _PORTWDF_PWDF3_MASK                                 0x8
#define _PORTWDF_PWDF4_POSN                                 0x4
#define _PORTWDF_PWDF4_POSITION                             0x4
#define _PORTWDF_PWDF4_SIZE                                 0x1
#define _PORTWDF_PWDF4_LENGTH                               0x1
#define _PORTWDF_PWDF4_MASK                                 0x10
#define _PORTWDF_PWDF5_POSN                                 0x5
#define _PORTWDF_PWDF5_POSITION                             0x5
#define _PORTWDF_PWDF5_SIZE                                 0x1
#define _PORTWDF_PWDF5_LENGTH                               0x1
#define _PORTWDF_PWDF5_MASK                                 0x20
#define _PORTWDF_PWDF6_POSN                                 0x6
#define _PORTWDF_PWDF6_POSITION                             0x6
#define _PORTWDF_PWDF6_SIZE                                 0x1
#define _PORTWDF_PWDF6_LENGTH                               0x1
#define _PORTWDF_PWDF6_MASK                                 0x40
#define _PORTWDF_PWDF7_POSN                                 0x7
#define _PORTWDF_PWDF7_POSITION                             0x7
#define _PORTWDF_PWDF7_SIZE                                 0x1
#define _PORTWDF_PWDF7_LENGTH                               0x1
#define _PORTWDF_PWDF7_MASK                                 0x80
#define _PORTWDF_DF_POSN                                    0x0
#define _PORTWDF_DF_POSITION                                0x0
#define _PORTWDF_DF_SIZE                                    0x8
#define _PORTWDF_DF_LENGTH                                  0x8
#define _PORTWDF_DF_MASK                                    0xFF
#define _PORTWDF_PWDF_POSN                                  0x0
#define _PORTWDF_PWDF_POSITION                              0x0
#define _PORTWDF_PWDF_SIZE                                  0x8
#define _PORTWDF_PWDF_LENGTH                                0x8
#define _PORTWDF_PWDF_MASK                                  0xFF

// Register: PORTWCON
#define PORTWCON PORTWCON
extern volatile unsigned char           PORTWCON            __at(0x10C);
#ifndef _LIB_BUILD
asm("PORTWCON equ 010Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKEN                  :1;
    };
} PORTWCONbits_t;
extern volatile PORTWCONbits_t PORTWCONbits __at(0x10C);
// bitfield macros
#define _PORTWCON_CLKEN_POSN                                0x0
#define _PORTWCON_CLKEN_POSITION                            0x0
#define _PORTWCON_CLKEN_SIZE                                0x1
#define _PORTWCON_CLKEN_LENGTH                              0x1
#define _PORTWCON_CLKEN_MASK                                0x1

// Register: ADCGA
#define ADCGA ADCGA
extern volatile unsigned char           ADCGA               __at(0x110);
#ifndef _LIB_BUILD
asm("ADCGA equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGA0                   :1;
        unsigned CGA1                   :1;
        unsigned CGA2                   :1;
        unsigned CGA3                   :1;
        unsigned CGA4                   :1;
        unsigned CGA5                   :1;
        unsigned CGA6                   :1;
        unsigned CGA7                   :1;
    };
    struct {
        unsigned ADCGA0                 :1;
        unsigned ADCGA1                 :1;
        unsigned ADCGA2                 :1;
        unsigned ADCGA3                 :1;
        unsigned ADCGA4                 :1;
        unsigned ADCGA5                 :1;
        unsigned ADCGA6                 :1;
        unsigned ADCGA7                 :1;
    };
} ADCGAbits_t;
extern volatile ADCGAbits_t ADCGAbits __at(0x110);
// bitfield macros
#define _ADCGA_CGA0_POSN                                    0x0
#define _ADCGA_CGA0_POSITION                                0x0
#define _ADCGA_CGA0_SIZE                                    0x1
#define _ADCGA_CGA0_LENGTH                                  0x1
#define _ADCGA_CGA0_MASK                                    0x1
#define _ADCGA_CGA1_POSN                                    0x1
#define _ADCGA_CGA1_POSITION                                0x1
#define _ADCGA_CGA1_SIZE                                    0x1
#define _ADCGA_CGA1_LENGTH                                  0x1
#define _ADCGA_CGA1_MASK                                    0x2
#define _ADCGA_CGA2_POSN                                    0x2
#define _ADCGA_CGA2_POSITION                                0x2
#define _ADCGA_CGA2_SIZE                                    0x1
#define _ADCGA_CGA2_LENGTH                                  0x1
#define _ADCGA_CGA2_MASK                                    0x4
#define _ADCGA_CGA3_POSN                                    0x3
#define _ADCGA_CGA3_POSITION                                0x3
#define _ADCGA_CGA3_SIZE                                    0x1
#define _ADCGA_CGA3_LENGTH                                  0x1
#define _ADCGA_CGA3_MASK                                    0x8
#define _ADCGA_CGA4_POSN                                    0x4
#define _ADCGA_CGA4_POSITION                                0x4
#define _ADCGA_CGA4_SIZE                                    0x1
#define _ADCGA_CGA4_LENGTH                                  0x1
#define _ADCGA_CGA4_MASK                                    0x10
#define _ADCGA_CGA5_POSN                                    0x5
#define _ADCGA_CGA5_POSITION                                0x5
#define _ADCGA_CGA5_SIZE                                    0x1
#define _ADCGA_CGA5_LENGTH                                  0x1
#define _ADCGA_CGA5_MASK                                    0x20
#define _ADCGA_CGA6_POSN                                    0x6
#define _ADCGA_CGA6_POSITION                                0x6
#define _ADCGA_CGA6_SIZE                                    0x1
#define _ADCGA_CGA6_LENGTH                                  0x1
#define _ADCGA_CGA6_MASK                                    0x40
#define _ADCGA_CGA7_POSN                                    0x7
#define _ADCGA_CGA7_POSITION                                0x7
#define _ADCGA_CGA7_SIZE                                    0x1
#define _ADCGA_CGA7_LENGTH                                  0x1
#define _ADCGA_CGA7_MASK                                    0x80
#define _ADCGA_ADCGA0_POSN                                  0x0
#define _ADCGA_ADCGA0_POSITION                              0x0
#define _ADCGA_ADCGA0_SIZE                                  0x1
#define _ADCGA_ADCGA0_LENGTH                                0x1
#define _ADCGA_ADCGA0_MASK                                  0x1
#define _ADCGA_ADCGA1_POSN                                  0x1
#define _ADCGA_ADCGA1_POSITION                              0x1
#define _ADCGA_ADCGA1_SIZE                                  0x1
#define _ADCGA_ADCGA1_LENGTH                                0x1
#define _ADCGA_ADCGA1_MASK                                  0x2
#define _ADCGA_ADCGA2_POSN                                  0x2
#define _ADCGA_ADCGA2_POSITION                              0x2
#define _ADCGA_ADCGA2_SIZE                                  0x1
#define _ADCGA_ADCGA2_LENGTH                                0x1
#define _ADCGA_ADCGA2_MASK                                  0x4
#define _ADCGA_ADCGA3_POSN                                  0x3
#define _ADCGA_ADCGA3_POSITION                              0x3
#define _ADCGA_ADCGA3_SIZE                                  0x1
#define _ADCGA_ADCGA3_LENGTH                                0x1
#define _ADCGA_ADCGA3_MASK                                  0x8
#define _ADCGA_ADCGA4_POSN                                  0x4
#define _ADCGA_ADCGA4_POSITION                              0x4
#define _ADCGA_ADCGA4_SIZE                                  0x1
#define _ADCGA_ADCGA4_LENGTH                                0x1
#define _ADCGA_ADCGA4_MASK                                  0x10
#define _ADCGA_ADCGA5_POSN                                  0x5
#define _ADCGA_ADCGA5_POSITION                              0x5
#define _ADCGA_ADCGA5_SIZE                                  0x1
#define _ADCGA_ADCGA5_LENGTH                                0x1
#define _ADCGA_ADCGA5_MASK                                  0x20
#define _ADCGA_ADCGA6_POSN                                  0x6
#define _ADCGA_ADCGA6_POSITION                              0x6
#define _ADCGA_ADCGA6_SIZE                                  0x1
#define _ADCGA_ADCGA6_LENGTH                                0x1
#define _ADCGA_ADCGA6_MASK                                  0x40
#define _ADCGA_ADCGA7_POSN                                  0x7
#define _ADCGA_ADCGA7_POSITION                              0x7
#define _ADCGA_ADCGA7_SIZE                                  0x1
#define _ADCGA_ADCGA7_LENGTH                                0x1
#define _ADCGA_ADCGA7_MASK                                  0x80

// Register: ADCGB
#define ADCGB ADCGB
extern volatile unsigned char           ADCGB               __at(0x111);
#ifndef _LIB_BUILD
asm("ADCGB equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGB0                   :1;
        unsigned CGB1                   :1;
        unsigned CGB2                   :1;
        unsigned CGB3                   :1;
        unsigned CGB4                   :1;
        unsigned CGB5                   :1;
        unsigned CGB6                   :1;
        unsigned CGB7                   :1;
    };
    struct {
        unsigned ADCGB0                 :1;
        unsigned ADCGB1                 :1;
        unsigned ADCGB2                 :1;
        unsigned ADCGB3                 :1;
        unsigned ADCGB4                 :1;
        unsigned ADCGB5                 :1;
        unsigned ADCGB6                 :1;
        unsigned ADCGB7                 :1;
    };
} ADCGBbits_t;
