garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
extern volatile ADCGBbits_t ADCGBbits __at(0x111);
// bitfield macros
#define _ADCGB_CGB0_POSN                                    0x0
#define _ADCGB_CGB0_POSITION                                0x0
#define _ADCGB_CGB0_SIZE                                    0x1
#define _ADCGB_CGB0_LENGTH                                  0x1
#define _ADCGB_CGB0_MASK                                    0x1
#define _ADCGB_CGB1_POSN                                    0x1
#define _ADCGB_CGB1_POSITION                                0x1
#define _ADCGB_CGB1_SIZE                                    0x1
#define _ADCGB_CGB1_LENGTH                                  0x1
#define _ADCGB_CGB1_MASK                                    0x2
#define _ADCGB_CGB2_POSN                                    0x2
#define _ADCGB_CGB2_POSITION                                0x2
#define _ADCGB_CGB2_SIZE                                    0x1
#define _ADCGB_CGB2_LENGTH                                  0x1
#define _ADCGB_CGB2_MASK                                    0x4
#define _ADCGB_CGB3_POSN                                    0x3
#define _ADCGB_CGB3_POSITION                                0x3
#define _ADCGB_CGB3_SIZE                                    0x1
#define _ADCGB_CGB3_LENGTH                                  0x1
#define _ADCGB_CGB3_MASK                                    0x8
#define _ADCGB_CGB4_POSN                                    0x4
#define _ADCGB_CGB4_POSITION                                0x4
#define _ADCGB_CGB4_SIZE                                    0x1
#define _ADCGB_CGB4_LENGTH                                  0x1
#define _ADCGB_CGB4_MASK                                    0x10
#define _ADCGB_CGB5_POSN                                    0x5
#define _ADCGB_CGB5_POSITION                                0x5
#define _ADCGB_CGB5_SIZE                                    0x1
#define _ADCGB_CGB5_LENGTH                                  0x1
#define _ADCGB_CGB5_MASK                                    0x20
#define _ADCGB_CGB6_POSN                                    0x6
#define _ADCGB_CGB6_POSITION                                0x6
#define _ADCGB_CGB6_SIZE                                    0x1
#define _ADCGB_CGB6_LENGTH                                  0x1
#define _ADCGB_CGB6_MASK                                    0x40
#define _ADCGB_CGB7_POSN                                    0x7
#define _ADCGB_CGB7_POSITION                                0x7
#define _ADCGB_CGB7_SIZE                                    0x1
#define _ADCGB_CGB7_LENGTH                                  0x1
#define _ADCGB_CGB7_MASK                                    0x80
#define _ADCGB_ADCGB0_POSN                                  0x0
#define _ADCGB_ADCGB0_POSITION                              0x0
#define _ADCGB_ADCGB0_SIZE                                  0x1
#define _ADCGB_ADCGB0_LENGTH                                0x1
#define _ADCGB_ADCGB0_MASK                                  0x1
#define _ADCGB_ADCGB1_POSN                                  0x1
#define _ADCGB_ADCGB1_POSITION                              0x1
#define _ADCGB_ADCGB1_SIZE                                  0x1
#define _ADCGB_ADCGB1_LENGTH                                0x1
#define _ADCGB_ADCGB1_MASK                                  0x2
#define _ADCGB_ADCGB2_POSN                                  0x2
#define _ADCGB_ADCGB2_POSITION                              0x2
#define _ADCGB_ADCGB2_SIZE                                  0x1
#define _ADCGB_ADCGB2_LENGTH                                0x1
#define _ADCGB_ADCGB2_MASK                                  0x4
#define _ADCGB_ADCGB3_POSN                                  0x3
#define _ADCGB_ADCGB3_POSITION                              0x3
#define _ADCGB_ADCGB3_SIZE                                  0x1
#define _ADCGB_ADCGB3_LENGTH                                0x1
#define _ADCGB_ADCGB3_MASK                                  0x8
#define _ADCGB_ADCGB4_POSN                                  0x4
#define _ADCGB_ADCGB4_POSITION                              0x4
#define _ADCGB_ADCGB4_SIZE                                  0x1
#define _ADCGB_ADCGB4_LENGTH                                0x1
#define _ADCGB_ADCGB4_MASK                                  0x10
#define _ADCGB_ADCGB5_POSN                                  0x5
#define _ADCGB_ADCGB5_POSITION                              0x5
#define _ADCGB_ADCGB5_SIZE                                  0x1
#define _ADCGB_ADCGB5_LENGTH                                0x1
#define _ADCGB_ADCGB5_MASK                                  0x20
#define _ADCGB_ADCGB6_POSN                                  0x6
#define _ADCGB_ADCGB6_POSITION                              0x6
#define _ADCGB_ADCGB6_SIZE                                  0x1
#define _ADCGB_ADCGB6_LENGTH                                0x1
#define _ADCGB_ADCGB6_MASK                                  0x40
#define _ADCGB_ADCGB7_POSN                                  0x7
#define _ADCGB_ADCGB7_POSITION                              0x7
#define _ADCGB_ADCGB7_SIZE                                  0x1
#define _ADCGB_ADCGB7_LENGTH                                0x1
#define _ADCGB_ADCGB7_MASK                                  0x80

// Register: ADCGC
#define ADCGC ADCGC
extern volatile unsigned char           ADCGC               __at(0x112);
#ifndef _LIB_BUILD
asm("ADCGC equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGC0                   :1;
        unsigned CGC1                   :1;
        unsigned CGC2                   :1;
        unsigned CGC3                   :1;
        unsigned CGC4                   :1;
        unsigned CGC5                   :1;
        unsigned CGC6                   :1;
        unsigned CGC7                   :1;
    };
    struct {
        unsigned ADCGC0                 :1;
        unsigned ADCGC1                 :1;
        unsigned ADCGC2                 :1;
        unsigned ADCGC3                 :1;
        unsigned ADCGC4                 :1;
        unsigned ADCGC5                 :1;
        unsigned ADCGC6                 :1;
        unsigned ADCGC7                 :1;
    };
} ADCGCbits_t;
extern volatile ADCGCbits_t ADCGCbits __at(0x112);
// bitfield macros
#define _ADCGC_CGC0_POSN                                    0x0
#define _ADCGC_CGC0_POSITION                                0x0
#define _ADCGC_CGC0_SIZE                                    0x1
#define _ADCGC_CGC0_LENGTH                                  0x1
#define _ADCGC_CGC0_MASK                                    0x1
#define _ADCGC_CGC1_POSN                                    0x1
#define _ADCGC_CGC1_POSITION                                0x1
#define _ADCGC_CGC1_SIZE                                    0x1
#define _ADCGC_CGC1_LENGTH                                  0x1
#define _ADCGC_CGC1_MASK                                    0x2
#define _ADCGC_CGC2_POSN                                    0x2
#define _ADCGC_CGC2_POSITION                                0x2
#define _ADCGC_CGC2_SIZE                                    0x1
#define _ADCGC_CGC2_LENGTH                                  0x1
#define _ADCGC_CGC2_MASK                                    0x4
#define _ADCGC_CGC3_POSN                                    0x3
#define _ADCGC_CGC3_POSITION                                0x3
#define _ADCGC_CGC3_SIZE                                    0x1
#define _ADCGC_CGC3_LENGTH                                  0x1
#define _ADCGC_CGC3_MASK                                    0x8
#define _ADCGC_CGC4_POSN                                    0x4
#define _ADCGC_CGC4_POSITION                                0x4
#define _ADCGC_CGC4_SIZE                                    0x1
#define _ADCGC_CGC4_LENGTH                                  0x1
#define _ADCGC_CGC4_MASK                                    0x10
#define _ADCGC_CGC5_POSN                                    0x5
#define _ADCGC_CGC5_POSITION                                0x5
#define _ADCGC_CGC5_SIZE                                    0x1
#define _ADCGC_CGC5_LENGTH                                  0x1
#define _ADCGC_CGC5_MASK                                    0x20
#define _ADCGC_CGC6_POSN                                    0x6
#define _ADCGC_CGC6_POSITION                                0x6
#define _ADCGC_CGC6_SIZE                                    0x1
#define _ADCGC_CGC6_LENGTH                                  0x1
#define _ADCGC_CGC6_MASK                                    0x40
#define _ADCGC_CGC7_POSN                                    0x7
#define _ADCGC_CGC7_POSITION                                0x7
#define _ADCGC_CGC7_SIZE                                    0x1
#define _ADCGC_CGC7_LENGTH                                  0x1
#define _ADCGC_CGC7_MASK                                    0x80
#define _ADCGC_ADCGC0_POSN                                  0x0
#define _ADCGC_ADCGC0_POSITION                              0x0
#define _ADCGC_ADCGC0_SIZE                                  0x1
#define _ADCGC_ADCGC0_LENGTH                                0x1
#define _ADCGC_ADCGC0_MASK                                  0x1
#define _ADCGC_ADCGC1_POSN                                  0x1
#define _ADCGC_ADCGC1_POSITION                              0x1
#define _ADCGC_ADCGC1_SIZE                                  0x1
#define _ADCGC_ADCGC1_LENGTH                                0x1
#define _ADCGC_ADCGC1_MASK                                  0x2
#define _ADCGC_ADCGC2_POSN                                  0x2
#define _ADCGC_ADCGC2_POSITION                              0x2
#define _ADCGC_ADCGC2_SIZE                                  0x1
#define _ADCGC_ADCGC2_LENGTH                                0x1
#define _ADCGC_ADCGC2_MASK                                  0x4
#define _ADCGC_ADCGC3_POSN                                  0x3
#define _ADCGC_ADCGC3_POSITION                              0x3
#define _ADCGC_ADCGC3_SIZE                                  0x1
#define _ADCGC_ADCGC3_LENGTH                                0x1
#define _ADCGC_ADCGC3_MASK                                  0x8
#define _ADCGC_ADCGC4_POSN                                  0x4
#define _ADCGC_ADCGC4_POSITION                              0x4
#define _ADCGC_ADCGC4_SIZE                                  0x1
#define _ADCGC_ADCGC4_LENGTH                                0x1
#define _ADCGC_ADCGC4_MASK                                  0x10
#define _ADCGC_ADCGC5_POSN                                  0x5
#define _ADCGC_ADCGC5_POSITION                              0x5
#define _ADCGC_ADCGC5_SIZE                                  0x1
#define _ADCGC_ADCGC5_LENGTH                                0x1
#define _ADCGC_ADCGC5_MASK                                  0x20
#define _ADCGC_ADCGC6_POSN                                  0x6
#define _ADCGC_ADCGC6_POSITION                              0x6
#define _ADCGC_ADCGC6_SIZE                                  0x1
#define _ADCGC_ADCGC6_LENGTH                                0x1
#define _ADCGC_ADCGC6_MASK                                  0x40
#define _ADCGC_ADCGC7_POSN                                  0x7
#define _ADCGC_ADCGC7_POSITION                              0x7
#define _ADCGC_ADCGC7_SIZE                                  0x1
#define _ADCGC_ADCGC7_LENGTH                                0x1
#define _ADCGC_ADCGC7_MASK                                  0x80

// Register: ADCGD
#define ADCGD ADCGD
extern volatile unsigned char           ADCGD               __at(0x113);
#ifndef _LIB_BUILD
asm("ADCGD equ 0113h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGD0                   :1;
        unsigned CGD1                   :1;
        unsigned CGD2                   :1;
        unsigned CGD3                   :1;
        unsigned CGD4                   :1;
        unsigned CGD5                   :1;
        unsigned CGD6                   :1;
        unsigned CGD7                   :1;
    };
    struct {
        unsigned ADCGD0                 :1;
        unsigned ADCGD1                 :1;
        unsigned ADCGD2                 :1;
        unsigned ADCGD3                 :1;
        unsigned ADCGD4                 :1;
        unsigned ADCGD5                 :1;
        unsigned ADCGD6                 :1;
        unsigned ADCGD7                 :1;
    };
} ADCGDbits_t;
