garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
extern volatile OPA2HWCbits_t OPA2HWCbits __at(0x12C);
// bitfield macros
#define _OPA2HWC_HWCL_POSN                                  0x0
#define _OPA2HWC_HWCL_POSITION                              0x0
#define _OPA2HWC_HWCL_SIZE                                  0x3
#define _OPA2HWC_HWCL_LENGTH                                0x3
#define _OPA2HWC_HWCL_MASK                                  0x7
#define _OPA2HWC_ORPOL_POSN                                 0x3
#define _OPA2HWC_ORPOL_POSITION                             0x3
#define _OPA2HWC_ORPOL_SIZE                                 0x1
#define _OPA2HWC_ORPOL_LENGTH                               0x1
#define _OPA2HWC_ORPOL_MASK                                 0x8
#define _OPA2HWC_HWCH_POSN                                  0x4
#define _OPA2HWC_HWCH_POSITION                              0x4
#define _OPA2HWC_HWCH_SIZE                                  0x3
#define _OPA2HWC_HWCH_LENGTH                                0x3
#define _OPA2HWC_HWCH_MASK                                  0x70
#define _OPA2HWC_OREN_POSN                                  0x7
#define _OPA2HWC_OREN_POSITION                              0x7
#define _OPA2HWC_OREN_SIZE                                  0x1
#define _OPA2HWC_OREN_LENGTH                                0x1
#define _OPA2HWC_OREN_MASK                                  0x80
#define _OPA2HWC_HWCL0_POSN                                 0x0
#define _OPA2HWC_HWCL0_POSITION                             0x0
#define _OPA2HWC_HWCL0_SIZE                                 0x1
#define _OPA2HWC_HWCL0_LENGTH                               0x1
#define _OPA2HWC_HWCL0_MASK                                 0x1
#define _OPA2HWC_HWCL1_POSN                                 0x1
#define _OPA2HWC_HWCL1_POSITION                             0x1
#define _OPA2HWC_HWCL1_SIZE                                 0x1
#define _OPA2HWC_HWCL1_LENGTH                               0x1
#define _OPA2HWC_HWCL1_MASK                                 0x2
#define _OPA2HWC_HWCL2_POSN                                 0x2
#define _OPA2HWC_HWCL2_POSITION                             0x2
#define _OPA2HWC_HWCL2_SIZE                                 0x1
#define _OPA2HWC_HWCL2_LENGTH                               0x1
#define _OPA2HWC_HWCL2_MASK                                 0x4
#define _OPA2HWC_HWCH0_POSN                                 0x4
#define _OPA2HWC_HWCH0_POSITION                             0x4
#define _OPA2HWC_HWCH0_SIZE                                 0x1
#define _OPA2HWC_HWCH0_LENGTH                               0x1
#define _OPA2HWC_HWCH0_MASK                                 0x10
#define _OPA2HWC_HWCH1_POSN                                 0x5
#define _OPA2HWC_HWCH1_POSITION                             0x5
#define _OPA2HWC_HWCH1_SIZE                                 0x1
#define _OPA2HWC_HWCH1_LENGTH                               0x1
#define _OPA2HWC_HWCH1_MASK                                 0x20
#define _OPA2HWC_HWCH2_POSN                                 0x6
#define _OPA2HWC_HWCH2_POSITION                             0x6
#define _OPA2HWC_HWCH2_SIZE                                 0x1
#define _OPA2HWC_HWCH2_LENGTH                               0x1
#define _OPA2HWC_HWCH2_MASK                                 0x40
#define _OPA2HWC_OPA2HWCL_POSN                              0x0
#define _OPA2HWC_OPA2HWCL_POSITION                          0x0
#define _OPA2HWC_OPA2HWCL_SIZE                              0x3
#define _OPA2HWC_OPA2HWCL_LENGTH                            0x3
#define _OPA2HWC_OPA2HWCL_MASK                              0x7
#define _OPA2HWC_OPA2ORPOL_POSN                             0x3
#define _OPA2HWC_OPA2ORPOL_POSITION                         0x3
#define _OPA2HWC_OPA2ORPOL_SIZE                             0x1
#define _OPA2HWC_OPA2ORPOL_LENGTH                           0x1
#define _OPA2HWC_OPA2ORPOL_MASK                             0x8
#define _OPA2HWC_OPA2HWCH_POSN                              0x4
#define _OPA2HWC_OPA2HWCH_POSITION                          0x4
#define _OPA2HWC_OPA2HWCH_SIZE                              0x3
#define _OPA2HWC_OPA2HWCH_LENGTH                            0x3
#define _OPA2HWC_OPA2HWCH_MASK                              0x70
#define _OPA2HWC_OPA2OREN_POSN                              0x7
#define _OPA2HWC_OPA2OREN_POSITION                          0x7
#define _OPA2HWC_OPA2OREN_SIZE                              0x1
#define _OPA2HWC_OPA2OREN_LENGTH                            0x1
#define _OPA2HWC_OPA2OREN_MASK                              0x80
#define _OPA2HWC_OPA2HWCL0_POSN                             0x0
#define _OPA2HWC_OPA2HWCL0_POSITION                         0x0
#define _OPA2HWC_OPA2HWCL0_SIZE                             0x1
#define _OPA2HWC_OPA2HWCL0_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCL0_MASK                             0x1
#define _OPA2HWC_OPA2HWCL1_POSN                             0x1
#define _OPA2HWC_OPA2HWCL1_POSITION                         0x1
#define _OPA2HWC_OPA2HWCL1_SIZE                             0x1
#define _OPA2HWC_OPA2HWCL1_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCL1_MASK                             0x2
#define _OPA2HWC_OPA2HWCL2_POSN                             0x2
#define _OPA2HWC_OPA2HWCL2_POSITION                         0x2
#define _OPA2HWC_OPA2HWCL2_SIZE                             0x1
#define _OPA2HWC_OPA2HWCL2_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCL2_MASK                             0x4
#define _OPA2HWC_OPA2HWCH0_POSN                             0x4
#define _OPA2HWC_OPA2HWCH0_POSITION                         0x4
#define _OPA2HWC_OPA2HWCH0_SIZE                             0x1
#define _OPA2HWC_OPA2HWCH0_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCH0_MASK                             0x10
#define _OPA2HWC_OPA2HWCH1_POSN                             0x5
#define _OPA2HWC_OPA2HWCH1_POSITION                         0x5
#define _OPA2HWC_OPA2HWCH1_SIZE                             0x1
#define _OPA2HWC_OPA2HWCH1_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCH1_MASK                             0x20
#define _OPA2HWC_OPA2HWCH2_POSN                             0x6
#define _OPA2HWC_OPA2HWCH2_POSITION                         0x6
#define _OPA2HWC_OPA2HWCH2_SIZE                             0x1
#define _OPA2HWC_OPA2HWCH2_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCH2_MASK                             0x40

// Register: OPA2OFFSET
#define OPA2OFFSET OPA2OFFSET
extern volatile unsigned char           OPA2OFFSET          __at(0x12D);
#ifndef _LIB_BUILD
asm("OPA2OFFSET equ 012Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFFSET                 :8;
    };
    struct {
        unsigned OFFSET0                :1;
        unsigned OFFSET1                :1;
        unsigned OFFSET2                :1;
        unsigned OFFSET3                :1;
        unsigned OFFSET4                :1;
        unsigned OFFSET5                :1;
        unsigned OFFSET6                :1;
        unsigned OFFSET7                :1;
    };
    struct {
        unsigned OPA2OFFSET             :8;
    };
    struct {
        unsigned OPA2OFFSET0            :1;
        unsigned OPA2OFFSET1            :1;
        unsigned OPA2OFFSET2            :1;
        unsigned OPA2OFFSET3            :1;
        unsigned OPA2OFFSET4            :1;
        unsigned OPA2OFFSET5            :1;
        unsigned OPA2OFFSET6            :1;
        unsigned OPA2OFFSET7            :1;
    };
} OPA2OFFSETbits_t;
extern volatile OPA2OFFSETbits_t OPA2OFFSETbits __at(0x12D);
// bitfield macros
#define _OPA2OFFSET_OFFSET_POSN                             0x0
#define _OPA2OFFSET_OFFSET_POSITION                         0x0
#define _OPA2OFFSET_OFFSET_SIZE                             0x8
#define _OPA2OFFSET_OFFSET_LENGTH                           0x8
#define _OPA2OFFSET_OFFSET_MASK                             0xFF
#define _OPA2OFFSET_OFFSET0_POSN                            0x0
#define _OPA2OFFSET_OFFSET0_POSITION                        0x0
#define _OPA2OFFSET_OFFSET0_SIZE                            0x1
#define _OPA2OFFSET_OFFSET0_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET0_MASK                            0x1
#define _OPA2OFFSET_OFFSET1_POSN                            0x1
#define _OPA2OFFSET_OFFSET1_POSITION                        0x1
#define _OPA2OFFSET_OFFSET1_SIZE                            0x1
#define _OPA2OFFSET_OFFSET1_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET1_MASK                            0x2
#define _OPA2OFFSET_OFFSET2_POSN                            0x2
#define _OPA2OFFSET_OFFSET2_POSITION                        0x2
#define _OPA2OFFSET_OFFSET2_SIZE                            0x1
#define _OPA2OFFSET_OFFSET2_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET2_MASK                            0x4
#define _OPA2OFFSET_OFFSET3_POSN                            0x3
#define _OPA2OFFSET_OFFSET3_POSITION                        0x3
#define _OPA2OFFSET_OFFSET3_SIZE                            0x1
#define _OPA2OFFSET_OFFSET3_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET3_MASK                            0x8
#define _OPA2OFFSET_OFFSET4_POSN                            0x4
#define _OPA2OFFSET_OFFSET4_POSITION                        0x4
#define _OPA2OFFSET_OFFSET4_SIZE                            0x1
#define _OPA2OFFSET_OFFSET4_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET4_MASK                            0x10
#define _OPA2OFFSET_OFFSET5_POSN                            0x5
#define _OPA2OFFSET_OFFSET5_POSITION                        0x5
#define _OPA2OFFSET_OFFSET5_SIZE                            0x1
#define _OPA2OFFSET_OFFSET5_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET5_MASK                            0x20
#define _OPA2OFFSET_OFFSET6_POSN                            0x6
#define _OPA2OFFSET_OFFSET6_POSITION                        0x6
#define _OPA2OFFSET_OFFSET6_SIZE                            0x1
#define _OPA2OFFSET_OFFSET6_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET6_MASK                            0x40
#define _OPA2OFFSET_OFFSET7_POSN                            0x7
#define _OPA2OFFSET_OFFSET7_POSITION                        0x7
#define _OPA2OFFSET_OFFSET7_SIZE                            0x1
#define _OPA2OFFSET_OFFSET7_LENGTH                          0x1
#define _OPA2OFFSET_OFFSET7_MASK                            0x80
#define _OPA2OFFSET_OPA2OFFSET_POSN                         0x0
#define _OPA2OFFSET_OPA2OFFSET_POSITION                     0x0
#define _OPA2OFFSET_OPA2OFFSET_SIZE                         0x8
#define _OPA2OFFSET_OPA2OFFSET_LENGTH                       0x8
#define _OPA2OFFSET_OPA2OFFSET_MASK                         0xFF
#define _OPA2OFFSET_OPA2OFFSET0_POSN                        0x0
#define _OPA2OFFSET_OPA2OFFSET0_POSITION                    0x0
#define _OPA2OFFSET_OPA2OFFSET0_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET0_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET0_MASK                        0x1
#define _OPA2OFFSET_OPA2OFFSET1_POSN                        0x1
#define _OPA2OFFSET_OPA2OFFSET1_POSITION                    0x1
#define _OPA2OFFSET_OPA2OFFSET1_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET1_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET1_MASK                        0x2
#define _OPA2OFFSET_OPA2OFFSET2_POSN                        0x2
#define _OPA2OFFSET_OPA2OFFSET2_POSITION                    0x2
#define _OPA2OFFSET_OPA2OFFSET2_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET2_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET2_MASK                        0x4
#define _OPA2OFFSET_OPA2OFFSET3_POSN                        0x3
#define _OPA2OFFSET_OPA2OFFSET3_POSITION                    0x3
#define _OPA2OFFSET_OPA2OFFSET3_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET3_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET3_MASK                        0x8
#define _OPA2OFFSET_OPA2OFFSET4_POSN                        0x4
#define _OPA2OFFSET_OPA2OFFSET4_POSITION                    0x4
#define _OPA2OFFSET_OPA2OFFSET4_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET4_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET4_MASK                        0x10
#define _OPA2OFFSET_OPA2OFFSET5_POSN                        0x5
#define _OPA2OFFSET_OPA2OFFSET5_POSITION                    0x5
#define _OPA2OFFSET_OPA2OFFSET5_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET5_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET5_MASK                        0x20
#define _OPA2OFFSET_OPA2OFFSET6_POSN                        0x6
#define _OPA2OFFSET_OPA2OFFSET6_POSITION                    0x6
#define _OPA2OFFSET_OPA2OFFSET6_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET6_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET6_MASK                        0x40
#define _OPA2OFFSET_OPA2OFFSET7_POSN                        0x7
#define _OPA2OFFSET_OPA2OFFSET7_POSITION                    0x7
#define _OPA2OFFSET_OPA2OFFSET7_SIZE                        0x1
#define _OPA2OFFSET_OPA2OFFSET7_LENGTH                      0x1
#define _OPA2OFFSET_OPA2OFFSET7_MASK                        0x80

// Register: OPA2ORS
#define OPA2ORS OPA2ORS
extern volatile unsigned char           OPA2ORS             __at(0x12E);
#ifndef _LIB_BUILD
asm("OPA2ORS equ 012Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORS                    :8;
    };
    struct {
        unsigned ORS0                   :1;
        unsigned ORS1                   :1;
        unsigned ORS2                   :1;
        unsigned ORS3                   :1;
        unsigned ORS4                   :1;
        unsigned ORS5                   :1;
        unsigned ORS6                   :1;
        unsigned ORS7                   :1;
    };
    struct {
        unsigned OPA2ORS                :8;
    };
    struct {
        unsigned OPA2ORS0               :1;
        unsigned OPA2ORS1               :1;
        unsigned OPA2ORS2               :1;
        unsigned OPA2ORS3               :1;
        unsigned OPA2ORS4               :1;
        unsigned OPA2ORS5               :1;
        unsigned OPA2ORS6               :1;
        unsigned OPA2ORS7               :1;
    };
} OPA2ORSbits_t;
extern volatile OPA2ORSbits_t OPA2ORSbits __at(0x12E);
// bitfield macros
#define _OPA2ORS_ORS_POSN                                   0x0
#define _OPA2ORS_ORS_POSITION                               0x0
#define _OPA2ORS_ORS_SIZE                                   0x8
#define _OPA2ORS_ORS_LENGTH                                 0x8
#define _OPA2ORS_ORS_MASK                                   0xFF
#define _OPA2ORS_ORS0_POSN                                  0x0
#define _OPA2ORS_ORS0_POSITION                              0x0
#define _OPA2ORS_ORS0_SIZE                                  0x1
#define _OPA2ORS_ORS0_LENGTH                                0x1
#define _OPA2ORS_ORS0_MASK                                  0x1
#define _OPA2ORS_ORS1_POSN                                  0x1
#define _OPA2ORS_ORS1_POSITION                              0x1
#define _OPA2ORS_ORS1_SIZE                                  0x1
#define _OPA2ORS_ORS1_LENGTH                                0x1
#define _OPA2ORS_ORS1_MASK                                  0x2
#define _OPA2ORS_ORS2_POSN                                  0x2
#define _OPA2ORS_ORS2_POSITION                              0x2
#define _OPA2ORS_ORS2_SIZE                                  0x1
#define _OPA2ORS_ORS2_LENGTH                                0x1
#define _OPA2ORS_ORS2_MASK                                  0x4
#define _OPA2ORS_ORS3_POSN                                  0x3
#define _OPA2ORS_ORS3_POSITION                              0x3
#define _OPA2ORS_ORS3_SIZE                                  0x1
#define _OPA2ORS_ORS3_LENGTH                                0x1
#define _OPA2ORS_ORS3_MASK                                  0x8
#define _OPA2ORS_ORS4_POSN                                  0x4
#define _OPA2ORS_ORS4_POSITION                              0x4
#define _OPA2ORS_ORS4_SIZE                                  0x1
#define _OPA2ORS_ORS4_LENGTH                                0x1
#define _OPA2ORS_ORS4_MASK                                  0x10
#define _OPA2ORS_ORS5_POSN                                  0x5
#define _OPA2ORS_ORS5_POSITION                              0x5
#define _OPA2ORS_ORS5_SIZE                                  0x1
#define _OPA2ORS_ORS5_LENGTH                                0x1
#define _OPA2ORS_ORS5_MASK                                  0x20
#define _OPA2ORS_ORS6_POSN                                  0x6
#define _OPA2ORS_ORS6_POSITION                              0x6
#define _OPA2ORS_ORS6_SIZE                                  0x1
#define _OPA2ORS_ORS6_LENGTH                                0x1
#define _OPA2ORS_ORS6_MASK                                  0x40
#define _OPA2ORS_ORS7_POSN                                  0x7
#define _OPA2ORS_ORS7_POSITION                              0x7
#define _OPA2ORS_ORS7_SIZE                                  0x1
#define _OPA2ORS_ORS7_LENGTH                                0x1
#define _OPA2ORS_ORS7_MASK                                  0x80
#define _OPA2ORS_OPA2ORS_POSN                               0x0
#define _OPA2ORS_OPA2ORS_POSITION                           0x0
#define _OPA2ORS_OPA2ORS_SIZE                               0x8
#define _OPA2ORS_OPA2ORS_LENGTH                             0x8
#define _OPA2ORS_OPA2ORS_MASK                               0xFF
#define _OPA2ORS_OPA2ORS0_POSN                              0x0
#define _OPA2ORS_OPA2ORS0_POSITION                          0x0
#define _OPA2ORS_OPA2ORS0_SIZE                              0x1
#define _OPA2ORS_OPA2ORS0_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS0_MASK                              0x1
#define _OPA2ORS_OPA2ORS1_POSN                              0x1
#define _OPA2ORS_OPA2ORS1_POSITION                          0x1
#define _OPA2ORS_OPA2ORS1_SIZE                              0x1
#define _OPA2ORS_OPA2ORS1_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS1_MASK                              0x2
#define _OPA2ORS_OPA2ORS2_POSN                              0x2
#define _OPA2ORS_OPA2ORS2_POSITION                          0x2
#define _OPA2ORS_OPA2ORS2_SIZE                              0x1
#define _OPA2ORS_OPA2ORS2_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS2_MASK                              0x4
#define _OPA2ORS_OPA2ORS3_POSN                              0x3
#define _OPA2ORS_OPA2ORS3_POSITION                          0x3
#define _OPA2ORS_OPA2ORS3_SIZE                              0x1
#define _OPA2ORS_OPA2ORS3_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS3_MASK                              0x8
#define _OPA2ORS_OPA2ORS4_POSN                              0x4
#define _OPA2ORS_OPA2ORS4_POSITION                          0x4
#define _OPA2ORS_OPA2ORS4_SIZE                              0x1
#define _OPA2ORS_OPA2ORS4_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS4_MASK                              0x10
#define _OPA2ORS_OPA2ORS5_POSN                              0x5
#define _OPA2ORS_OPA2ORS5_POSITION                          0x5
#define _OPA2ORS_OPA2ORS5_SIZE                              0x1
#define _OPA2ORS_OPA2ORS5_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS5_MASK                              0x20
#define _OPA2ORS_OPA2ORS6_POSN                              0x6
#define _OPA2ORS_OPA2ORS6_POSITION                          0x6
#define _OPA2ORS_OPA2ORS6_SIZE                              0x1
#define _OPA2ORS_OPA2ORS6_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS6_MASK                              0x40
#define _OPA2ORS_OPA2ORS7_POSN                              0x7
#define _OPA2ORS_OPA2ORS7_POSITION                          0x7
#define _OPA2ORS_OPA2ORS7_SIZE                              0x1
#define _OPA2ORS_OPA2ORS7_LENGTH                            0x1
#define _OPA2ORS_OPA2ORS7_MASK                              0x80

