garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
extern volatile APMSTART1Lbits_t APMSTART1Lbits __at(0x1C5);
// bitfield macros
#define _APMSTART1L_START1_POSN                             0x0
#define _APMSTART1L_START1_POSITION                         0x0
#define _APMSTART1L_START1_SIZE                             0x8
#define _APMSTART1L_START1_LENGTH                           0x8
#define _APMSTART1L_START1_MASK                             0xFF

// Register: APMSTART1H
#define APMSTART1H APMSTART1H
extern volatile unsigned char           APMSTART1H          __at(0x1C6);
#ifndef _LIB_BUILD
asm("APMSTART1H equ 01C6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned START1                 :8;
    };
} APMSTART1Hbits_t;
extern volatile APMSTART1Hbits_t APMSTART1Hbits __at(0x1C6);
// bitfield macros
#define _APMSTART1H_START1_POSN                             0x0
#define _APMSTART1H_START1_POSITION                         0x0
#define _APMSTART1H_START1_SIZE                             0x8
#define _APMSTART1H_START1_LENGTH                           0x8
#define _APMSTART1H_START1_MASK                             0xFF

// Register: APMPERS1
#define APMPERS1 APMPERS1
extern volatile unsigned short          APMPERS1            __at(0x1C7);
#ifndef _LIB_BUILD
asm("APMPERS1 equ 01C7h");
#endif

// Register: APMPERS1L
#define APMPERS1L APMPERS1L
extern volatile unsigned char           APMPERS1L           __at(0x1C7);
#ifndef _LIB_BUILD
asm("APMPERS1L equ 01C7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMPERS1               :8;
    };
    struct {
        unsigned                        :2;
        unsigned BG                     :1;
        unsigned FVR1                   :1;
        unsigned FVR2                   :1;
        unsigned ADCD                   :1;
        unsigned ADCA                   :1;
        unsigned TEMP                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned APMPERS1_2             :1;
        unsigned APMPERS1_3             :1;
        unsigned APMPERS1_4             :1;
        unsigned APMPERS1_5             :1;
        unsigned APMPERS1_6             :1;
        unsigned APMPERS1_7             :1;
    };
} APMPERS1Lbits_t;
extern volatile APMPERS1Lbits_t APMPERS1Lbits __at(0x1C7);
// bitfield macros
#define _APMPERS1L_APMPERS1_POSN                            0x0
#define _APMPERS1L_APMPERS1_POSITION                        0x0
#define _APMPERS1L_APMPERS1_SIZE                            0x8
#define _APMPERS1L_APMPERS1_LENGTH                          0x8
#define _APMPERS1L_APMPERS1_MASK                            0xFF
#define _APMPERS1L_BG_POSN                                  0x2
#define _APMPERS1L_BG_POSITION                              0x2
#define _APMPERS1L_BG_SIZE                                  0x1
#define _APMPERS1L_BG_LENGTH                                0x1
#define _APMPERS1L_BG_MASK                                  0x4
#define _APMPERS1L_FVR1_POSN                                0x3
#define _APMPERS1L_FVR1_POSITION                            0x3
#define _APMPERS1L_FVR1_SIZE                                0x1
#define _APMPERS1L_FVR1_LENGTH                              0x1
#define _APMPERS1L_FVR1_MASK                                0x8
#define _APMPERS1L_FVR2_POSN                                0x4
#define _APMPERS1L_FVR2_POSITION                            0x4
#define _APMPERS1L_FVR2_SIZE                                0x1
#define _APMPERS1L_FVR2_LENGTH                              0x1
#define _APMPERS1L_FVR2_MASK                                0x10
#define _APMPERS1L_ADCD_POSN                                0x5
#define _APMPERS1L_ADCD_POSITION                            0x5
#define _APMPERS1L_ADCD_SIZE                                0x1
#define _APMPERS1L_ADCD_LENGTH                              0x1
#define _APMPERS1L_ADCD_MASK                                0x20
#define _APMPERS1L_ADCA_POSN                                0x6
#define _APMPERS1L_ADCA_POSITION                            0x6
#define _APMPERS1L_ADCA_SIZE                                0x1
#define _APMPERS1L_ADCA_LENGTH                              0x1
#define _APMPERS1L_ADCA_MASK                                0x40
#define _APMPERS1L_TEMP_POSN                                0x7
#define _APMPERS1L_TEMP_POSITION                            0x7
#define _APMPERS1L_TEMP_SIZE                                0x1
#define _APMPERS1L_TEMP_LENGTH                              0x1
#define _APMPERS1L_TEMP_MASK                                0x80
#define _APMPERS1L_APMPERS1_2_POSN                          0x2
#define _APMPERS1L_APMPERS1_2_POSITION                      0x2
#define _APMPERS1L_APMPERS1_2_SIZE                          0x1
#define _APMPERS1L_APMPERS1_2_LENGTH                        0x1
#define _APMPERS1L_APMPERS1_2_MASK                          0x4
#define _APMPERS1L_APMPERS1_3_POSN                          0x3
#define _APMPERS1L_APMPERS1_3_POSITION                      0x3
#define _APMPERS1L_APMPERS1_3_SIZE                          0x1
#define _APMPERS1L_APMPERS1_3_LENGTH                        0x1
#define _APMPERS1L_APMPERS1_3_MASK                          0x8
#define _APMPERS1L_APMPERS1_4_POSN                          0x4
#define _APMPERS1L_APMPERS1_4_POSITION                      0x4
#define _APMPERS1L_APMPERS1_4_SIZE                          0x1
#define _APMPERS1L_APMPERS1_4_LENGTH                        0x1
#define _APMPERS1L_APMPERS1_4_MASK                          0x10
#define _APMPERS1L_APMPERS1_5_POSN                          0x5
#define _APMPERS1L_APMPERS1_5_POSITION                      0x5
#define _APMPERS1L_APMPERS1_5_SIZE                          0x1
#define _APMPERS1L_APMPERS1_5_LENGTH                        0x1
#define _APMPERS1L_APMPERS1_5_MASK                          0x20
#define _APMPERS1L_APMPERS1_6_POSN                          0x6
#define _APMPERS1L_APMPERS1_6_POSITION                      0x6
#define _APMPERS1L_APMPERS1_6_SIZE                          0x1
#define _APMPERS1L_APMPERS1_6_LENGTH                        0x1
#define _APMPERS1L_APMPERS1_6_MASK                          0x40
#define _APMPERS1L_APMPERS1_7_POSN                          0x7
#define _APMPERS1L_APMPERS1_7_POSITION                      0x7
#define _APMPERS1L_APMPERS1_7_SIZE                          0x1
#define _APMPERS1L_APMPERS1_7_LENGTH                        0x1
#define _APMPERS1L_APMPERS1_7_MASK                          0x80

// Register: APMPERS1H
#define APMPERS1H APMPERS1H
extern volatile unsigned char           APMPERS1H           __at(0x1C8);
#ifndef _LIB_BUILD
asm("APMPERS1H equ 01C8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMPERS1               :8;
    };
    struct {
        unsigned OPA1                   :1;
        unsigned OPA2                   :1;
        unsigned DAC1                   :1;
        unsigned DAC2                   :1;
        unsigned DAC3                   :1;
        unsigned CMP1                   :1;
        unsigned CMP2                   :1;
        unsigned ZCD                    :1;
    };
    struct {
        unsigned APMPERS1_8             :1;
        unsigned APMPERS1_9             :1;
        unsigned APMPERS1_10            :1;
        unsigned APMPERS1_11            :1;
        unsigned APMPERS1_12            :1;
        unsigned APMPERS1_13            :1;
        unsigned APMPERS1_14            :1;
        unsigned APMPERS1_15            :1;
    };
} APMPERS1Hbits_t;
extern volatile APMPERS1Hbits_t APMPERS1Hbits __at(0x1C8);
// bitfield macros
#define _APMPERS1H_APMPERS1_POSN                            0x0
#define _APMPERS1H_APMPERS1_POSITION                        0x0
#define _APMPERS1H_APMPERS1_SIZE                            0x8
#define _APMPERS1H_APMPERS1_LENGTH                          0x8
#define _APMPERS1H_APMPERS1_MASK                            0xFF
#define _APMPERS1H_OPA1_POSN                                0x0
#define _APMPERS1H_OPA1_POSITION                            0x0
#define _APMPERS1H_OPA1_SIZE                                0x1
#define _APMPERS1H_OPA1_LENGTH                              0x1
#define _APMPERS1H_OPA1_MASK                                0x1
#define _APMPERS1H_OPA2_POSN                                0x1
#define _APMPERS1H_OPA2_POSITION                            0x1
#define _APMPERS1H_OPA2_SIZE                                0x1
#define _APMPERS1H_OPA2_LENGTH                              0x1
#define _APMPERS1H_OPA2_MASK                                0x2
#define _APMPERS1H_DAC1_POSN                                0x2
#define _APMPERS1H_DAC1_POSITION                            0x2
#define _APMPERS1H_DAC1_SIZE                                0x1
#define _APMPERS1H_DAC1_LENGTH                              0x1
#define _APMPERS1H_DAC1_MASK                                0x4
#define _APMPERS1H_DAC2_POSN                                0x3
#define _APMPERS1H_DAC2_POSITION                            0x3
#define _APMPERS1H_DAC2_SIZE                                0x1
#define _APMPERS1H_DAC2_LENGTH                              0x1
#define _APMPERS1H_DAC2_MASK                                0x8
#define _APMPERS1H_DAC3_POSN                                0x4
#define _APMPERS1H_DAC3_POSITION                            0x4
#define _APMPERS1H_DAC3_SIZE                                0x1
#define _APMPERS1H_DAC3_LENGTH                              0x1
#define _APMPERS1H_DAC3_MASK                                0x10
#define _APMPERS1H_CMP1_POSN                                0x5
#define _APMPERS1H_CMP1_POSITION                            0x5
#define _APMPERS1H_CMP1_SIZE                                0x1
#define _APMPERS1H_CMP1_LENGTH                              0x1
#define _APMPERS1H_CMP1_MASK                                0x20
#define _APMPERS1H_CMP2_POSN                                0x6
#define _APMPERS1H_CMP2_POSITION                            0x6
#define _APMPERS1H_CMP2_SIZE                                0x1
#define _APMPERS1H_CMP2_LENGTH                              0x1
#define _APMPERS1H_CMP2_MASK                                0x40
#define _APMPERS1H_ZCD_POSN                                 0x7
#define _APMPERS1H_ZCD_POSITION                             0x7
#define _APMPERS1H_ZCD_SIZE                                 0x1
#define _APMPERS1H_ZCD_LENGTH                               0x1
#define _APMPERS1H_ZCD_MASK                                 0x80
#define _APMPERS1H_APMPERS1_8_POSN                          0x0
#define _APMPERS1H_APMPERS1_8_POSITION                      0x0
#define _APMPERS1H_APMPERS1_8_SIZE                          0x1
#define _APMPERS1H_APMPERS1_8_LENGTH                        0x1
#define _APMPERS1H_APMPERS1_8_MASK                          0x1
#define _APMPERS1H_APMPERS1_9_POSN                          0x1
#define _APMPERS1H_APMPERS1_9_POSITION                      0x1
#define _APMPERS1H_APMPERS1_9_SIZE                          0x1
#define _APMPERS1H_APMPERS1_9_LENGTH                        0x1
#define _APMPERS1H_APMPERS1_9_MASK                          0x2
#define _APMPERS1H_APMPERS1_10_POSN                         0x2
#define _APMPERS1H_APMPERS1_10_POSITION                     0x2
#define _APMPERS1H_APMPERS1_10_SIZE                         0x1
#define _APMPERS1H_APMPERS1_10_LENGTH                       0x1
#define _APMPERS1H_APMPERS1_10_MASK                         0x4
#define _APMPERS1H_APMPERS1_11_POSN                         0x3
#define _APMPERS1H_APMPERS1_11_POSITION                     0x3
#define _APMPERS1H_APMPERS1_11_SIZE                         0x1
#define _APMPERS1H_APMPERS1_11_LENGTH                       0x1
#define _APMPERS1H_APMPERS1_11_MASK                         0x8
#define _APMPERS1H_APMPERS1_12_POSN                         0x4
#define _APMPERS1H_APMPERS1_12_POSITION                     0x4
#define _APMPERS1H_APMPERS1_12_SIZE                         0x1
#define _APMPERS1H_APMPERS1_12_LENGTH                       0x1
#define _APMPERS1H_APMPERS1_12_MASK                         0x10
#define _APMPERS1H_APMPERS1_13_POSN                         0x5
#define _APMPERS1H_APMPERS1_13_POSITION                     0x5
#define _APMPERS1H_APMPERS1_13_SIZE                         0x1
#define _APMPERS1H_APMPERS1_13_LENGTH                       0x1
#define _APMPERS1H_APMPERS1_13_MASK                         0x20
#define _APMPERS1H_APMPERS1_14_POSN                         0x6
#define _APMPERS1H_APMPERS1_14_POSITION                     0x6
#define _APMPERS1H_APMPERS1_14_SIZE                         0x1
#define _APMPERS1H_APMPERS1_14_LENGTH                       0x1
#define _APMPERS1H_APMPERS1_14_MASK                         0x40
#define _APMPERS1H_APMPERS1_15_POSN                         0x7
#define _APMPERS1H_APMPERS1_15_POSITION                     0x7
#define _APMPERS1H_APMPERS1_15_SIZE                         0x1
#define _APMPERS1H_APMPERS1_15_LENGTH                       0x1
#define _APMPERS1H_APMPERS1_15_MASK                         0x80

