garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
// Register: APMSTATUSL
#define APMSTATUSL APMSTATUSL
extern volatile unsigned char           APMSTATUSL          __at(0x1D9);
#ifndef _LIB_BUILD
asm("APMSTATUSL equ 01D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMSTATUS              :8;
    };
    struct {
        unsigned                        :2;
        unsigned BG                     :1;
        unsigned FVR1                   :1;
        unsigned FVR2                   :1;
        unsigned ADCD                   :1;
        unsigned ADCA                   :1;
        unsigned TEMP                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned APMSTATUS_2            :1;
        unsigned APMSTATUS_3            :1;
        unsigned APMSTATUS_4            :1;
        unsigned APMSTATUS_5            :1;
        unsigned APMSTATUS_6            :1;
        unsigned APMSTATUS_7            :1;
    };
} APMSTATUSLbits_t;
extern volatile APMSTATUSLbits_t APMSTATUSLbits __at(0x1D9);
// bitfield macros
#define _APMSTATUSL_APMSTATUS_POSN                          0x0
#define _APMSTATUSL_APMSTATUS_POSITION                      0x0
#define _APMSTATUSL_APMSTATUS_SIZE                          0x8
#define _APMSTATUSL_APMSTATUS_LENGTH                        0x8
#define _APMSTATUSL_APMSTATUS_MASK                          0xFF
#define _APMSTATUSL_BG_POSN                                 0x2
#define _APMSTATUSL_BG_POSITION                             0x2
#define _APMSTATUSL_BG_SIZE                                 0x1
#define _APMSTATUSL_BG_LENGTH                               0x1
#define _APMSTATUSL_BG_MASK                                 0x4
#define _APMSTATUSL_FVR1_POSN                               0x3
#define _APMSTATUSL_FVR1_POSITION                           0x3
#define _APMSTATUSL_FVR1_SIZE                               0x1
#define _APMSTATUSL_FVR1_LENGTH                             0x1
#define _APMSTATUSL_FVR1_MASK                               0x8
#define _APMSTATUSL_FVR2_POSN                               0x4
#define _APMSTATUSL_FVR2_POSITION                           0x4
#define _APMSTATUSL_FVR2_SIZE                               0x1
#define _APMSTATUSL_FVR2_LENGTH                             0x1
#define _APMSTATUSL_FVR2_MASK                               0x10
#define _APMSTATUSL_ADCD_POSN                               0x5
#define _APMSTATUSL_ADCD_POSITION                           0x5
#define _APMSTATUSL_ADCD_SIZE                               0x1
#define _APMSTATUSL_ADCD_LENGTH                             0x1
#define _APMSTATUSL_ADCD_MASK                               0x20
#define _APMSTATUSL_ADCA_POSN                               0x6
#define _APMSTATUSL_ADCA_POSITION                           0x6
#define _APMSTATUSL_ADCA_SIZE                               0x1
#define _APMSTATUSL_ADCA_LENGTH                             0x1
#define _APMSTATUSL_ADCA_MASK                               0x40
#define _APMSTATUSL_TEMP_POSN                               0x7
#define _APMSTATUSL_TEMP_POSITION                           0x7
#define _APMSTATUSL_TEMP_SIZE                               0x1
#define _APMSTATUSL_TEMP_LENGTH                             0x1
#define _APMSTATUSL_TEMP_MASK                               0x80
#define _APMSTATUSL_APMSTATUS_2_POSN                        0x2
#define _APMSTATUSL_APMSTATUS_2_POSITION                    0x2
#define _APMSTATUSL_APMSTATUS_2_SIZE                        0x1
#define _APMSTATUSL_APMSTATUS_2_LENGTH                      0x1
#define _APMSTATUSL_APMSTATUS_2_MASK                        0x4
#define _APMSTATUSL_APMSTATUS_3_POSN                        0x3
#define _APMSTATUSL_APMSTATUS_3_POSITION                    0x3
#define _APMSTATUSL_APMSTATUS_3_SIZE                        0x1
#define _APMSTATUSL_APMSTATUS_3_LENGTH                      0x1
#define _APMSTATUSL_APMSTATUS_3_MASK                        0x8
#define _APMSTATUSL_APMSTATUS_4_POSN                        0x4
#define _APMSTATUSL_APMSTATUS_4_POSITION                    0x4
#define _APMSTATUSL_APMSTATUS_4_SIZE                        0x1
#define _APMSTATUSL_APMSTATUS_4_LENGTH                      0x1
#define _APMSTATUSL_APMSTATUS_4_MASK                        0x10
#define _APMSTATUSL_APMSTATUS_5_POSN                        0x5
#define _APMSTATUSL_APMSTATUS_5_POSITION                    0x5
#define _APMSTATUSL_APMSTATUS_5_SIZE                        0x1
#define _APMSTATUSL_APMSTATUS_5_LENGTH                      0x1
#define _APMSTATUSL_APMSTATUS_5_MASK                        0x20
#define _APMSTATUSL_APMSTATUS_6_POSN                        0x6
#define _APMSTATUSL_APMSTATUS_6_POSITION                    0x6
#define _APMSTATUSL_APMSTATUS_6_SIZE                        0x1
#define _APMSTATUSL_APMSTATUS_6_LENGTH                      0x1
#define _APMSTATUSL_APMSTATUS_6_MASK                        0x40
#define _APMSTATUSL_APMSTATUS_7_POSN                        0x7
#define _APMSTATUSL_APMSTATUS_7_POSITION                    0x7
#define _APMSTATUSL_APMSTATUS_7_SIZE                        0x1
#define _APMSTATUSL_APMSTATUS_7_LENGTH                      0x1
#define _APMSTATUSL_APMSTATUS_7_MASK                        0x80

// Register: APMSTATUSH
#define APMSTATUSH APMSTATUSH
extern volatile unsigned char           APMSTATUSH          __at(0x1DA);
#ifndef _LIB_BUILD
asm("APMSTATUSH equ 01DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMSTATUS              :8;
    };
    struct {
        unsigned OPA1                   :1;
        unsigned OPA2                   :1;
        unsigned DAC1                   :1;
        unsigned DAC2                   :1;
        unsigned DAC3                   :1;
        unsigned CMP1                   :1;
        unsigned CMP2                   :1;
        unsigned ZCD                    :1;
    };
    struct {
        unsigned APMSTATUS_8            :1;
        unsigned APMSTATUS_9            :1;
        unsigned APMSTATUS_10           :1;
        unsigned APMSTATUS_11           :1;
        unsigned APMSTATUS_12           :1;
        unsigned APMSTATUS_13           :1;
        unsigned APMSTATUS_14           :1;
        unsigned APMSTATUS_15           :1;
    };
} APMSTATUSHbits_t;
extern volatile APMSTATUSHbits_t APMSTATUSHbits __at(0x1DA);
// bitfield macros
#define _APMSTATUSH_APMSTATUS_POSN                          0x0
#define _APMSTATUSH_APMSTATUS_POSITION                      0x0
#define _APMSTATUSH_APMSTATUS_SIZE                          0x8
#define _APMSTATUSH_APMSTATUS_LENGTH                        0x8
#define _APMSTATUSH_APMSTATUS_MASK                          0xFF
#define _APMSTATUSH_OPA1_POSN                               0x0
#define _APMSTATUSH_OPA1_POSITION                           0x0
#define _APMSTATUSH_OPA1_SIZE                               0x1
#define _APMSTATUSH_OPA1_LENGTH                             0x1
#define _APMSTATUSH_OPA1_MASK                               0x1
#define _APMSTATUSH_OPA2_POSN                               0x1
#define _APMSTATUSH_OPA2_POSITION                           0x1
#define _APMSTATUSH_OPA2_SIZE                               0x1
#define _APMSTATUSH_OPA2_LENGTH                             0x1
#define _APMSTATUSH_OPA2_MASK                               0x2
#define _APMSTATUSH_DAC1_POSN                               0x2
#define _APMSTATUSH_DAC1_POSITION                           0x2
#define _APMSTATUSH_DAC1_SIZE                               0x1
#define _APMSTATUSH_DAC1_LENGTH                             0x1
#define _APMSTATUSH_DAC1_MASK                               0x4
#define _APMSTATUSH_DAC2_POSN                               0x3
#define _APMSTATUSH_DAC2_POSITION                           0x3
#define _APMSTATUSH_DAC2_SIZE                               0x1
#define _APMSTATUSH_DAC2_LENGTH                             0x1
#define _APMSTATUSH_DAC2_MASK                               0x8
#define _APMSTATUSH_DAC3_POSN                               0x4
#define _APMSTATUSH_DAC3_POSITION                           0x4
#define _APMSTATUSH_DAC3_SIZE                               0x1
#define _APMSTATUSH_DAC3_LENGTH                             0x1
#define _APMSTATUSH_DAC3_MASK                               0x10
#define _APMSTATUSH_CMP1_POSN                               0x5
#define _APMSTATUSH_CMP1_POSITION                           0x5
#define _APMSTATUSH_CMP1_SIZE                               0x1
#define _APMSTATUSH_CMP1_LENGTH                             0x1
#define _APMSTATUSH_CMP1_MASK                               0x20
#define _APMSTATUSH_CMP2_POSN                               0x6
#define _APMSTATUSH_CMP2_POSITION                           0x6
#define _APMSTATUSH_CMP2_SIZE                               0x1
#define _APMSTATUSH_CMP2_LENGTH                             0x1
#define _APMSTATUSH_CMP2_MASK                               0x40
#define _APMSTATUSH_ZCD_POSN                                0x7
#define _APMSTATUSH_ZCD_POSITION                            0x7
#define _APMSTATUSH_ZCD_SIZE                                0x1
#define _APMSTATUSH_ZCD_LENGTH                              0x1
#define _APMSTATUSH_ZCD_MASK                                0x80
#define _APMSTATUSH_APMSTATUS_8_POSN                        0x0
#define _APMSTATUSH_APMSTATUS_8_POSITION                    0x0
#define _APMSTATUSH_APMSTATUS_8_SIZE                        0x1
#define _APMSTATUSH_APMSTATUS_8_LENGTH                      0x1
#define _APMSTATUSH_APMSTATUS_8_MASK                        0x1
#define _APMSTATUSH_APMSTATUS_9_POSN                        0x1
#define _APMSTATUSH_APMSTATUS_9_POSITION                    0x1
#define _APMSTATUSH_APMSTATUS_9_SIZE                        0x1
#define _APMSTATUSH_APMSTATUS_9_LENGTH                      0x1
#define _APMSTATUSH_APMSTATUS_9_MASK                        0x2
#define _APMSTATUSH_APMSTATUS_10_POSN                       0x2
#define _APMSTATUSH_APMSTATUS_10_POSITION                   0x2
#define _APMSTATUSH_APMSTATUS_10_SIZE                       0x1
#define _APMSTATUSH_APMSTATUS_10_LENGTH                     0x1
#define _APMSTATUSH_APMSTATUS_10_MASK                       0x4
#define _APMSTATUSH_APMSTATUS_11_POSN                       0x3
#define _APMSTATUSH_APMSTATUS_11_POSITION                   0x3
#define _APMSTATUSH_APMSTATUS_11_SIZE                       0x1
#define _APMSTATUSH_APMSTATUS_11_LENGTH                     0x1
#define _APMSTATUSH_APMSTATUS_11_MASK                       0x8
#define _APMSTATUSH_APMSTATUS_12_POSN                       0x4
#define _APMSTATUSH_APMSTATUS_12_POSITION                   0x4
#define _APMSTATUSH_APMSTATUS_12_SIZE                       0x1
#define _APMSTATUSH_APMSTATUS_12_LENGTH                     0x1
#define _APMSTATUSH_APMSTATUS_12_MASK                       0x10
#define _APMSTATUSH_APMSTATUS_13_POSN                       0x5
#define _APMSTATUSH_APMSTATUS_13_POSITION                   0x5
#define _APMSTATUSH_APMSTATUS_13_SIZE                       0x1
#define _APMSTATUSH_APMSTATUS_13_LENGTH                     0x1
#define _APMSTATUSH_APMSTATUS_13_MASK                       0x20
#define _APMSTATUSH_APMSTATUS_14_POSN                       0x6
#define _APMSTATUSH_APMSTATUS_14_POSITION                   0x6
#define _APMSTATUSH_APMSTATUS_14_SIZE                       0x1
#define _APMSTATUSH_APMSTATUS_14_LENGTH                     0x1
#define _APMSTATUSH_APMSTATUS_14_MASK                       0x40
#define _APMSTATUSH_APMSTATUS_15_POSN                       0x7
#define _APMSTATUSH_APMSTATUS_15_POSITION                   0x7
#define _APMSTATUSH_APMSTATUS_15_SIZE                       0x1
#define _APMSTATUSH_APMSTATUS_15_LENGTH                     0x1
#define _APMSTATUSH_APMSTATUS_15_MASK                       0x80

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x200);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0200h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x200);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x201);
#ifndef _LIB_BUILD
asm("RA0PPS equ 0201h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
        unsigned RA0PPS5                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0x201);
// bitfield macros
#define _RA0PPS_RA0PPS0_POSN                                0x0
#define _RA0PPS_RA0PPS0_POSITION                            0x0
#define _RA0PPS_RA0PPS0_SIZE                                0x1
#define _RA0PPS_RA0PPS0_LENGTH                              0x1
#define _RA0PPS_RA0PPS0_MASK                                0x1
#define _RA0PPS_RA0PPS1_POSN                                0x1
#define _RA0PPS_RA0PPS1_POSITION                            0x1
#define _RA0PPS_RA0PPS1_SIZE                                0x1
#define _RA0PPS_RA0PPS1_LENGTH                              0x1
#define _RA0PPS_RA0PPS1_MASK                                0x2
#define _RA0PPS_RA0PPS2_POSN                                0x2
#define _RA0PPS_RA0PPS2_POSITION                            0x2
#define _RA0PPS_RA0PPS2_SIZE                                0x1
#define _RA0PPS_RA0PPS2_LENGTH                              0x1
#define _RA0PPS_RA0PPS2_MASK                                0x4
#define _RA0PPS_RA0PPS3_POSN                                0x3
#define _RA0PPS_RA0PPS3_POSITION                            0x3
#define _RA0PPS_RA0PPS3_SIZE                                0x1
#define _RA0PPS_RA0PPS3_LENGTH                              0x1
#define _RA0PPS_RA0PPS3_MASK                                0x8
#define _RA0PPS_RA0PPS4_POSN                                0x4
#define _RA0PPS_RA0PPS4_POSITION                            0x4
#define _RA0PPS_RA0PPS4_SIZE                                0x1
#define _RA0PPS_RA0PPS4_LENGTH                              0x1
#define _RA0PPS_RA0PPS4_MASK                                0x10
#define _RA0PPS_RA0PPS5_POSN                                0x5
#define _RA0PPS_RA0PPS5_POSITION                            0x5
#define _RA0PPS_RA0PPS5_SIZE                                0x1
#define _RA0PPS_RA0PPS5_LENGTH                              0x1
#define _RA0PPS_RA0PPS5_MASK                                0x20

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0x202);
#ifndef _LIB_BUILD
asm("RA1PPS equ 0202h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
        unsigned RA1PPS4                :1;
        unsigned RA1PPS5                :1;
    };
} RA1PPSbits_t;
