garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
extern volatile OPA2ORPPSbits_t OPA2ORPPSbits __at(0x277);
// bitfield macros
#define _OPA2ORPPS_PIN_POSN                                 0x0
#define _OPA2ORPPS_PIN_POSITION                             0x0
#define _OPA2ORPPS_PIN_SIZE                                 0x3
#define _OPA2ORPPS_PIN_LENGTH                               0x3
#define _OPA2ORPPS_PIN_MASK                                 0x7
#define _OPA2ORPPS_PORT_POSN                                0x3
#define _OPA2ORPPS_PORT_POSITION                            0x3
#define _OPA2ORPPS_PORT_SIZE                                0x3
#define _OPA2ORPPS_PORT_LENGTH                              0x3
#define _OPA2ORPPS_PORT_MASK                                0x38
#define _OPA2ORPPS_OPA2PPS0_POSN                            0x0
#define _OPA2ORPPS_OPA2PPS0_POSITION                        0x0
#define _OPA2ORPPS_OPA2PPS0_SIZE                            0x1
#define _OPA2ORPPS_OPA2PPS0_LENGTH                          0x1
#define _OPA2ORPPS_OPA2PPS0_MASK                            0x1
#define _OPA2ORPPS_OPA2PPS1_POSN                            0x1
#define _OPA2ORPPS_OPA2PPS1_POSITION                        0x1
#define _OPA2ORPPS_OPA2PPS1_SIZE                            0x1
#define _OPA2ORPPS_OPA2PPS1_LENGTH                          0x1
#define _OPA2ORPPS_OPA2PPS1_MASK                            0x2
#define _OPA2ORPPS_OPA2PPS2_POSN                            0x2
#define _OPA2ORPPS_OPA2PPS2_POSITION                        0x2
#define _OPA2ORPPS_OPA2PPS2_SIZE                            0x1
#define _OPA2ORPPS_OPA2PPS2_LENGTH                          0x1
#define _OPA2ORPPS_OPA2PPS2_MASK                            0x4
#define _OPA2ORPPS_OPA2PPS3_POSN                            0x3
#define _OPA2ORPPS_OPA2PPS3_POSITION                        0x3
#define _OPA2ORPPS_OPA2PPS3_SIZE                            0x1
#define _OPA2ORPPS_OPA2PPS3_LENGTH                          0x1
#define _OPA2ORPPS_OPA2PPS3_MASK                            0x8
#define _OPA2ORPPS_OPA2PPS4_POSN                            0x4
#define _OPA2ORPPS_OPA2PPS4_POSITION                        0x4
#define _OPA2ORPPS_OPA2PPS4_SIZE                            0x1
#define _OPA2ORPPS_OPA2PPS4_LENGTH                          0x1
#define _OPA2ORPPS_OPA2PPS4_MASK                            0x10
#define _OPA2ORPPS_OPA2PPS5_POSN                            0x5
#define _OPA2ORPPS_OPA2PPS5_POSITION                        0x5
#define _OPA2ORPPS_OPA2PPS5_SIZE                            0x1
#define _OPA2ORPPS_OPA2PPS5_LENGTH                          0x1
#define _OPA2ORPPS_OPA2PPS5_MASK                            0x20
#define _OPA2ORPPS_OPA2PPS_POSN                             0x0
#define _OPA2ORPPS_OPA2PPS_POSITION                         0x0
#define _OPA2ORPPS_OPA2PPS_SIZE                             0x6
#define _OPA2ORPPS_OPA2PPS_LENGTH                           0x6
#define _OPA2ORPPS_OPA2PPS_MASK                             0x3F

// Register: TUIN0PPS
#define TUIN0PPS TUIN0PPS
extern volatile unsigned char           TUIN0PPS            __at(0x278);
#ifndef _LIB_BUILD
asm("TUIN0PPS equ 0278h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TUIN0PPS0              :1;
        unsigned TUIN0PPS1              :1;
        unsigned TUIN0PPS2              :1;
        unsigned TUIN0PPS3              :1;
        unsigned TUIN0PPS4              :1;
        unsigned TUIN0PPS5              :1;
    };
    struct {
        unsigned TUIN0PPS               :6;
    };
} TUIN0PPSbits_t;
extern volatile TUIN0PPSbits_t TUIN0PPSbits __at(0x278);
// bitfield macros
#define _TUIN0PPS_PIN_POSN                                  0x0
#define _TUIN0PPS_PIN_POSITION                              0x0
#define _TUIN0PPS_PIN_SIZE                                  0x3
#define _TUIN0PPS_PIN_LENGTH                                0x3
#define _TUIN0PPS_PIN_MASK                                  0x7
#define _TUIN0PPS_PORT_POSN                                 0x3
#define _TUIN0PPS_PORT_POSITION                             0x3
#define _TUIN0PPS_PORT_SIZE                                 0x3
#define _TUIN0PPS_PORT_LENGTH                               0x3
#define _TUIN0PPS_PORT_MASK                                 0x38
#define _TUIN0PPS_TUIN0PPS0_POSN                            0x0
#define _TUIN0PPS_TUIN0PPS0_POSITION                        0x0
#define _TUIN0PPS_TUIN0PPS0_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS0_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS0_MASK                            0x1
#define _TUIN0PPS_TUIN0PPS1_POSN                            0x1
#define _TUIN0PPS_TUIN0PPS1_POSITION                        0x1
#define _TUIN0PPS_TUIN0PPS1_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS1_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS1_MASK                            0x2
#define _TUIN0PPS_TUIN0PPS2_POSN                            0x2
#define _TUIN0PPS_TUIN0PPS2_POSITION                        0x2
#define _TUIN0PPS_TUIN0PPS2_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS2_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS2_MASK                            0x4
#define _TUIN0PPS_TUIN0PPS3_POSN                            0x3
#define _TUIN0PPS_TUIN0PPS3_POSITION                        0x3
#define _TUIN0PPS_TUIN0PPS3_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS3_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS3_MASK                            0x8
#define _TUIN0PPS_TUIN0PPS4_POSN                            0x4
#define _TUIN0PPS_TUIN0PPS4_POSITION                        0x4
#define _TUIN0PPS_TUIN0PPS4_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS4_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS4_MASK                            0x10
#define _TUIN0PPS_TUIN0PPS5_POSN                            0x5
#define _TUIN0PPS_TUIN0PPS5_POSITION                        0x5
#define _TUIN0PPS_TUIN0PPS5_SIZE                            0x1
#define _TUIN0PPS_TUIN0PPS5_LENGTH                          0x1
#define _TUIN0PPS_TUIN0PPS5_MASK                            0x20
#define _TUIN0PPS_TUIN0PPS_POSN                             0x0
#define _TUIN0PPS_TUIN0PPS_POSITION                         0x0
#define _TUIN0PPS_TUIN0PPS_SIZE                             0x6
#define _TUIN0PPS_TUIN0PPS_LENGTH                           0x6
#define _TUIN0PPS_TUIN0PPS_MASK                             0x3F

// Register: TUIN1PPS
#define TUIN1PPS TUIN1PPS
extern volatile unsigned char           TUIN1PPS            __at(0x279);
#ifndef _LIB_BUILD
asm("TUIN1PPS equ 0279h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TUIN1PPS0              :1;
        unsigned TUIN1PPS1              :1;
        unsigned TUIN1PPS2              :1;
        unsigned TUIN1PPS3              :1;
        unsigned TUIN1PPS4              :1;
        unsigned TUIN1PPS5              :1;
    };
    struct {
        unsigned TUIN1PPS               :6;
    };
} TUIN1PPSbits_t;
extern volatile TUIN1PPSbits_t TUIN1PPSbits __at(0x279);
// bitfield macros
#define _TUIN1PPS_PIN_POSN                                  0x0
#define _TUIN1PPS_PIN_POSITION                              0x0
#define _TUIN1PPS_PIN_SIZE                                  0x3
#define _TUIN1PPS_PIN_LENGTH                                0x3
#define _TUIN1PPS_PIN_MASK                                  0x7
#define _TUIN1PPS_PORT_POSN                                 0x3
#define _TUIN1PPS_PORT_POSITION                             0x3
#define _TUIN1PPS_PORT_SIZE                                 0x3
#define _TUIN1PPS_PORT_LENGTH                               0x3
#define _TUIN1PPS_PORT_MASK                                 0x38
#define _TUIN1PPS_TUIN1PPS0_POSN                            0x0
#define _TUIN1PPS_TUIN1PPS0_POSITION                        0x0
#define _TUIN1PPS_TUIN1PPS0_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS0_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS0_MASK                            0x1
#define _TUIN1PPS_TUIN1PPS1_POSN                            0x1
#define _TUIN1PPS_TUIN1PPS1_POSITION                        0x1
#define _TUIN1PPS_TUIN1PPS1_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS1_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS1_MASK                            0x2
#define _TUIN1PPS_TUIN1PPS2_POSN                            0x2
#define _TUIN1PPS_TUIN1PPS2_POSITION                        0x2
#define _TUIN1PPS_TUIN1PPS2_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS2_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS2_MASK                            0x4
#define _TUIN1PPS_TUIN1PPS3_POSN                            0x3
#define _TUIN1PPS_TUIN1PPS3_POSITION                        0x3
#define _TUIN1PPS_TUIN1PPS3_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS3_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS3_MASK                            0x8
#define _TUIN1PPS_TUIN1PPS4_POSN                            0x4
#define _TUIN1PPS_TUIN1PPS4_POSITION                        0x4
#define _TUIN1PPS_TUIN1PPS4_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS4_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS4_MASK                            0x10
#define _TUIN1PPS_TUIN1PPS5_POSN                            0x5
#define _TUIN1PPS_TUIN1PPS5_POSITION                        0x5
#define _TUIN1PPS_TUIN1PPS5_SIZE                            0x1
#define _TUIN1PPS_TUIN1PPS5_LENGTH                          0x1
#define _TUIN1PPS_TUIN1PPS5_MASK                            0x20
#define _TUIN1PPS_TUIN1PPS_POSN                             0x0
#define _TUIN1PPS_TUIN1PPS_POSITION                         0x0
#define _TUIN1PPS_TUIN1PPS_SIZE                             0x6
#define _TUIN1PPS_TUIN1PPS_LENGTH                           0x6
#define _TUIN1PPS_TUIN1PPS_MASK                             0x3F

