garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
// Register: CRCOUTU
#define CRCOUTU CRCOUTU
extern volatile unsigned char           CRCOUTU             __at(0x354);
#ifndef _LIB_BUILD
asm("CRCOUTU equ 0354h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUT                    :8;
    };
    struct {
        unsigned OUT16                  :1;
        unsigned OUT17                  :1;
        unsigned OUT18                  :1;
        unsigned OUT19                  :1;
        unsigned OUT20                  :1;
        unsigned OUT21                  :1;
        unsigned OUT22                  :1;
        unsigned OUT23                  :1;
    };
} CRCOUTUbits_t;
extern volatile CRCOUTUbits_t CRCOUTUbits __at(0x354);
// bitfield macros
#define _CRCOUTU_OUT_POSN                                   0x0
#define _CRCOUTU_OUT_POSITION                               0x0
#define _CRCOUTU_OUT_SIZE                                   0x8
#define _CRCOUTU_OUT_LENGTH                                 0x8
#define _CRCOUTU_OUT_MASK                                   0xFF
#define _CRCOUTU_OUT16_POSN                                 0x0
#define _CRCOUTU_OUT16_POSITION                             0x0
#define _CRCOUTU_OUT16_SIZE                                 0x1
#define _CRCOUTU_OUT16_LENGTH                               0x1
#define _CRCOUTU_OUT16_MASK                                 0x1
#define _CRCOUTU_OUT17_POSN                                 0x1
#define _CRCOUTU_OUT17_POSITION                             0x1
#define _CRCOUTU_OUT17_SIZE                                 0x1
#define _CRCOUTU_OUT17_LENGTH                               0x1
#define _CRCOUTU_OUT17_MASK                                 0x2
#define _CRCOUTU_OUT18_POSN                                 0x2
#define _CRCOUTU_OUT18_POSITION                             0x2
#define _CRCOUTU_OUT18_SIZE                                 0x1
#define _CRCOUTU_OUT18_LENGTH                               0x1
#define _CRCOUTU_OUT18_MASK                                 0x4
#define _CRCOUTU_OUT19_POSN                                 0x3
#define _CRCOUTU_OUT19_POSITION                             0x3
#define _CRCOUTU_OUT19_SIZE                                 0x1
#define _CRCOUTU_OUT19_LENGTH                               0x1
#define _CRCOUTU_OUT19_MASK                                 0x8
#define _CRCOUTU_OUT20_POSN                                 0x4
#define _CRCOUTU_OUT20_POSITION                             0x4
#define _CRCOUTU_OUT20_SIZE                                 0x1
#define _CRCOUTU_OUT20_LENGTH                               0x1
#define _CRCOUTU_OUT20_MASK                                 0x10
#define _CRCOUTU_OUT21_POSN                                 0x5
#define _CRCOUTU_OUT21_POSITION                             0x5
#define _CRCOUTU_OUT21_SIZE                                 0x1
#define _CRCOUTU_OUT21_LENGTH                               0x1
#define _CRCOUTU_OUT21_MASK                                 0x20
#define _CRCOUTU_OUT22_POSN                                 0x6
#define _CRCOUTU_OUT22_POSITION                             0x6
#define _CRCOUTU_OUT22_SIZE                                 0x1
#define _CRCOUTU_OUT22_LENGTH                               0x1
#define _CRCOUTU_OUT22_MASK                                 0x40
#define _CRCOUTU_OUT23_POSN                                 0x7
#define _CRCOUTU_OUT23_POSITION                             0x7
#define _CRCOUTU_OUT23_SIZE                                 0x1
#define _CRCOUTU_OUT23_LENGTH                               0x1
#define _CRCOUTU_OUT23_MASK                                 0x80

// Register: CRCSHFTU
#define CRCSHFTU CRCSHFTU
extern volatile unsigned char           CRCSHFTU            __at(0x354);
#ifndef _LIB_BUILD
asm("CRCSHFTU equ 0354h");
#endif
// aliases
extern volatile unsigned char           CRCSHIFTU           __at(0x354);
#ifndef _LIB_BUILD
asm("CRCSHIFTU equ 0354h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT16                :1;
        unsigned SHIFT17                :1;
        unsigned SHIFT18                :1;
        unsigned SHIFT19                :1;
        unsigned SHIFT20                :1;
        unsigned SHIFT21                :1;
        unsigned SHIFT22                :1;
        unsigned SHIFT23                :1;
    };
} CRCSHFTUbits_t;
extern volatile CRCSHFTUbits_t CRCSHFTUbits __at(0x354);
// bitfield macros
#define _CRCSHFTU_SHIFT_POSN                                0x0
#define _CRCSHFTU_SHIFT_POSITION                            0x0
#define _CRCSHFTU_SHIFT_SIZE                                0x8
#define _CRCSHFTU_SHIFT_LENGTH                              0x8
#define _CRCSHFTU_SHIFT_MASK                                0xFF
#define _CRCSHFTU_SHIFT16_POSN                              0x0
#define _CRCSHFTU_SHIFT16_POSITION                          0x0
#define _CRCSHFTU_SHIFT16_SIZE                              0x1
#define _CRCSHFTU_SHIFT16_LENGTH                            0x1
#define _CRCSHFTU_SHIFT16_MASK                              0x1
#define _CRCSHFTU_SHIFT17_POSN                              0x1
#define _CRCSHFTU_SHIFT17_POSITION                          0x1
#define _CRCSHFTU_SHIFT17_SIZE                              0x1
#define _CRCSHFTU_SHIFT17_LENGTH                            0x1
#define _CRCSHFTU_SHIFT17_MASK                              0x2
#define _CRCSHFTU_SHIFT18_POSN                              0x2
#define _CRCSHFTU_SHIFT18_POSITION                          0x2
#define _CRCSHFTU_SHIFT18_SIZE                              0x1
#define _CRCSHFTU_SHIFT18_LENGTH                            0x1
#define _CRCSHFTU_SHIFT18_MASK                              0x4
#define _CRCSHFTU_SHIFT19_POSN                              0x3
#define _CRCSHFTU_SHIFT19_POSITION                          0x3
#define _CRCSHFTU_SHIFT19_SIZE                              0x1
#define _CRCSHFTU_SHIFT19_LENGTH                            0x1
#define _CRCSHFTU_SHIFT19_MASK                              0x8
#define _CRCSHFTU_SHIFT20_POSN                              0x4
#define _CRCSHFTU_SHIFT20_POSITION                          0x4
#define _CRCSHFTU_SHIFT20_SIZE                              0x1
#define _CRCSHFTU_SHIFT20_LENGTH                            0x1
#define _CRCSHFTU_SHIFT20_MASK                              0x10
#define _CRCSHFTU_SHIFT21_POSN                              0x5
#define _CRCSHFTU_SHIFT21_POSITION                          0x5
#define _CRCSHFTU_SHIFT21_SIZE                              0x1
#define _CRCSHFTU_SHIFT21_LENGTH                            0x1
#define _CRCSHFTU_SHIFT21_MASK                              0x20
#define _CRCSHFTU_SHIFT22_POSN                              0x6
#define _CRCSHFTU_SHIFT22_POSITION                          0x6
#define _CRCSHFTU_SHIFT22_SIZE                              0x1
#define _CRCSHFTU_SHIFT22_LENGTH                            0x1
#define _CRCSHFTU_SHIFT22_MASK                              0x40
#define _CRCSHFTU_SHIFT23_POSN                              0x7
#define _CRCSHFTU_SHIFT23_POSITION                          0x7
#define _CRCSHFTU_SHIFT23_SIZE                              0x1
#define _CRCSHFTU_SHIFT23_LENGTH                            0x1
#define _CRCSHFTU_SHIFT23_MASK                              0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT16                :1;
        unsigned SHIFT17                :1;
        unsigned SHIFT18                :1;
        unsigned SHIFT19                :1;
        unsigned SHIFT20                :1;
        unsigned SHIFT21                :1;
        unsigned SHIFT22                :1;
        unsigned SHIFT23                :1;
    };
} CRCSHIFTUbits_t;
