garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
// Register: ADCLK
#define ADCLK ADCLK
extern volatile unsigned char           ADCLK               __at(0x3FA);
#ifndef _LIB_BUILD
asm("ADCLK equ 03FAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :6;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ADCS3                  :1;
        unsigned ADCS4                  :1;
        unsigned ADCS5                  :1;
    };
    struct {
        unsigned ADCS                   :6;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
        unsigned CS5                    :1;
    };
} ADCLKbits_t;
extern volatile ADCLKbits_t ADCLKbits __at(0x3FA);
// bitfield macros
#define _ADCLK_CS_POSN                                      0x0
#define _ADCLK_CS_POSITION                                  0x0
#define _ADCLK_CS_SIZE                                      0x6
#define _ADCLK_CS_LENGTH                                    0x6
#define _ADCLK_CS_MASK                                      0x3F
#define _ADCLK_ADCS0_POSN                                   0x0
#define _ADCLK_ADCS0_POSITION                               0x0
#define _ADCLK_ADCS0_SIZE                                   0x1
#define _ADCLK_ADCS0_LENGTH                                 0x1
#define _ADCLK_ADCS0_MASK                                   0x1
#define _ADCLK_ADCS1_POSN                                   0x1
#define _ADCLK_ADCS1_POSITION                               0x1
#define _ADCLK_ADCS1_SIZE                                   0x1
#define _ADCLK_ADCS1_LENGTH                                 0x1
#define _ADCLK_ADCS1_MASK                                   0x2
#define _ADCLK_ADCS2_POSN                                   0x2
#define _ADCLK_ADCS2_POSITION                               0x2
#define _ADCLK_ADCS2_SIZE                                   0x1
#define _ADCLK_ADCS2_LENGTH                                 0x1
#define _ADCLK_ADCS2_MASK                                   0x4
#define _ADCLK_ADCS3_POSN                                   0x3
#define _ADCLK_ADCS3_POSITION                               0x3
#define _ADCLK_ADCS3_SIZE                                   0x1
#define _ADCLK_ADCS3_LENGTH                                 0x1
#define _ADCLK_ADCS3_MASK                                   0x8
#define _ADCLK_ADCS4_POSN                                   0x4
#define _ADCLK_ADCS4_POSITION                               0x4
#define _ADCLK_ADCS4_SIZE                                   0x1
#define _ADCLK_ADCS4_LENGTH                                 0x1
#define _ADCLK_ADCS4_MASK                                   0x10
#define _ADCLK_ADCS5_POSN                                   0x5
#define _ADCLK_ADCS5_POSITION                               0x5
#define _ADCLK_ADCS5_SIZE                                   0x1
#define _ADCLK_ADCS5_LENGTH                                 0x1
#define _ADCLK_ADCS5_MASK                                   0x20
#define _ADCLK_ADCS_POSN                                    0x0
#define _ADCLK_ADCS_POSITION                                0x0
#define _ADCLK_ADCS_SIZE                                    0x6
#define _ADCLK_ADCS_LENGTH                                  0x6
#define _ADCLK_ADCS_MASK                                    0x3F
#define _ADCLK_CS0_POSN                                     0x0
#define _ADCLK_CS0_POSITION                                 0x0
#define _ADCLK_CS0_SIZE                                     0x1
#define _ADCLK_CS0_LENGTH                                   0x1
#define _ADCLK_CS0_MASK                                     0x1
#define _ADCLK_CS1_POSN                                     0x1
#define _ADCLK_CS1_POSITION                                 0x1
#define _ADCLK_CS1_SIZE                                     0x1
#define _ADCLK_CS1_LENGTH                                   0x1
#define _ADCLK_CS1_MASK                                     0x2
#define _ADCLK_CS2_POSN                                     0x2
#define _ADCLK_CS2_POSITION                                 0x2
#define _ADCLK_CS2_SIZE                                     0x1
#define _ADCLK_CS2_LENGTH                                   0x1
#define _ADCLK_CS2_MASK                                     0x4
#define _ADCLK_CS3_POSN                                     0x3
#define _ADCLK_CS3_POSITION                                 0x3
#define _ADCLK_CS3_SIZE                                     0x1
#define _ADCLK_CS3_LENGTH                                   0x1
#define _ADCLK_CS3_MASK                                     0x8
#define _ADCLK_CS4_POSN                                     0x4
#define _ADCLK_CS4_POSITION                                 0x4
#define _ADCLK_CS4_SIZE                                     0x1
#define _ADCLK_CS4_LENGTH                                   0x1
#define _ADCLK_CS4_MASK                                     0x10
#define _ADCLK_CS5_POSN                                     0x5
#define _ADCLK_CS5_POSITION                                 0x5
#define _ADCLK_CS5_SIZE                                     0x1
#define _ADCLK_CS5_LENGTH                                   0x1
#define _ADCLK_CS5_MASK                                     0x20

// Register: ADCTX
#define ADCTX ADCTX
extern volatile unsigned char           ADCTX               __at(0x3FB);
#ifndef _LIB_BUILD
asm("ADCTX equ 03FBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTX                    :2;
        unsigned                        :5;
        unsigned CTXSW                  :1;
    };
    struct {
        unsigned CTX0                   :1;
        unsigned CTX1                   :1;
    };
    struct {
        unsigned ADCTX                  :2;
        unsigned                        :5;
        unsigned ADCTXSW                :1;
    };
    struct {
        unsigned ADCTX0                 :1;
        unsigned ADCTX1                 :1;
    };
} ADCTXbits_t;
extern volatile ADCTXbits_t ADCTXbits __at(0x3FB);
// bitfield macros
#define _ADCTX_CTX_POSN                                     0x0
#define _ADCTX_CTX_POSITION                                 0x0
#define _ADCTX_CTX_SIZE                                     0x2
#define _ADCTX_CTX_LENGTH                                   0x2
#define _ADCTX_CTX_MASK                                     0x3
#define _ADCTX_CTXSW_POSN                                   0x7
#define _ADCTX_CTXSW_POSITION                               0x7
#define _ADCTX_CTXSW_SIZE                                   0x1
#define _ADCTX_CTXSW_LENGTH                                 0x1
#define _ADCTX_CTXSW_MASK                                   0x80
#define _ADCTX_CTX0_POSN                                    0x0
#define _ADCTX_CTX0_POSITION                                0x0
#define _ADCTX_CTX0_SIZE                                    0x1
#define _ADCTX_CTX0_LENGTH                                  0x1
#define _ADCTX_CTX0_MASK                                    0x1
#define _ADCTX_CTX1_POSN                                    0x1
#define _ADCTX_CTX1_POSITION                                0x1
#define _ADCTX_CTX1_SIZE                                    0x1
#define _ADCTX_CTX1_LENGTH                                  0x1
#define _ADCTX_CTX1_MASK                                    0x2
#define _ADCTX_ADCTX_POSN                                   0x0
#define _ADCTX_ADCTX_POSITION                               0x0
#define _ADCTX_ADCTX_SIZE                                   0x2
#define _ADCTX_ADCTX_LENGTH                                 0x2
#define _ADCTX_ADCTX_MASK                                   0x3
#define _ADCTX_ADCTXSW_POSN                                 0x7
#define _ADCTX_ADCTXSW_POSITION                             0x7
#define _ADCTX_ADCTXSW_SIZE                                 0x1
#define _ADCTX_ADCTXSW_LENGTH                               0x1
#define _ADCTX_ADCTXSW_MASK                                 0x80
#define _ADCTX_ADCTX0_POSN                                  0x0
#define _ADCTX_ADCTX0_POSITION                              0x0
#define _ADCTX_ADCTX0_SIZE                                  0x1
#define _ADCTX_ADCTX0_LENGTH                                0x1
#define _ADCTX_ADCTX0_MASK                                  0x1
#define _ADCTX_ADCTX1_POSN                                  0x1
#define _ADCTX_ADCTX1_POSITION                              0x1
#define _ADCTX_ADCTX1_SIZE                                  0x1
#define _ADCTX_ADCTX1_LENGTH                                0x1
#define _ADCTX_ADCTX1_MASK                                  0x2

