garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
extern volatile __bit                   ADACQ9              __at(0x1F79);	// @ (0x3EF * 8 + 1)
#define                                 ADACQ9_bit          _BIT_ACCESS(ADACQH,1)
// ADACT<ADACT0>
extern volatile __bit                   ADACT0              __at(0x1FC8);	// @ (0x3F9 * 8 + 0)
#define                                 ADACT0_bit          _BIT_ACCESS(ADACT,0)
// ADACT<ADACT1>
extern volatile __bit                   ADACT1              __at(0x1FC9);	// @ (0x3F9 * 8 + 1)
#define                                 ADACT1_bit          _BIT_ACCESS(ADACT,1)
// ADACT<ADACT2>
extern volatile __bit                   ADACT2              __at(0x1FCA);	// @ (0x3F9 * 8 + 2)
#define                                 ADACT2_bit          _BIT_ACCESS(ADACT,2)
// ADACT<ADACT3>
extern volatile __bit                   ADACT3              __at(0x1FCB);	// @ (0x3F9 * 8 + 3)
#define                                 ADACT3_bit          _BIT_ACCESS(ADACT,3)
// ADACT<ADACT4>
extern volatile __bit                   ADACT4              __at(0x1FCC);	// @ (0x3F9 * 8 + 4)
#define                                 ADACT4_bit          _BIT_ACCESS(ADACT,4)
// ADACT<ADACT5>
extern volatile __bit                   ADACT5              __at(0x1FCD);	// @ (0x3F9 * 8 + 5)
#define                                 ADACT5_bit          _BIT_ACCESS(ADACT,5)
// ADACTPPS<ADACTPPS0>
extern volatile __bit                   ADACTPPS0           __at(0x1348);	// @ (0x269 * 8 + 0)
#define                                 ADACTPPS0_bit       _BIT_ACCESS(ADACTPPS,0)
// ADACTPPS<ADACTPPS1>
extern volatile __bit                   ADACTPPS1           __at(0x1349);	// @ (0x269 * 8 + 1)
#define                                 ADACTPPS1_bit       _BIT_ACCESS(ADACTPPS,1)
// ADACTPPS<ADACTPPS2>
extern volatile __bit                   ADACTPPS2           __at(0x134A);	// @ (0x269 * 8 + 2)
#define                                 ADACTPPS2_bit       _BIT_ACCESS(ADACTPPS,2)
// ADACTPPS<ADACTPPS3>
extern volatile __bit                   ADACTPPS3           __at(0x134B);	// @ (0x269 * 8 + 3)
#define                                 ADACTPPS3_bit       _BIT_ACCESS(ADACTPPS,3)
// ADACTPPS<ADACTPPS4>
extern volatile __bit                   ADACTPPS4           __at(0x134C);	// @ (0x269 * 8 + 4)
#define                                 ADACTPPS4_bit       _BIT_ACCESS(ADACTPPS,4)
// ADACTPPS<ADACTPPS5>
extern volatile __bit                   ADACTPPS5           __at(0x134D);	// @ (0x269 * 8 + 5)
#define                                 ADACTPPS5_bit       _BIT_ACCESS(ADACTPPS,5)
// ADSTAT<ADAOV>
extern volatile __bit                   ADAOV               __at(0x1FBF);	// @ (0x3F7 * 8 + 7)
#define                                 ADAOV_bit           _BIT_ACCESS(ADSTAT,7)
// ADCON3<ADCALC0>
extern volatile __bit                   ADCALC0             __at(0x1FB4);	// @ (0x3F6 * 8 + 4)
#define                                 ADCALC0_bit         _BIT_ACCESS(ADCON3,4)
// ADCON3<ADCALC1>
extern volatile __bit                   ADCALC1             __at(0x1FB5);	// @ (0x3F6 * 8 + 5)
#define                                 ADCALC1_bit         _BIT_ACCESS(ADCON3,5)
// ADCON3<ADCALC2>
extern volatile __bit                   ADCALC2             __at(0x1FB6);	// @ (0x3F6 * 8 + 6)
#define                                 ADCALC2_bit         _BIT_ACCESS(ADCON3,6)
// ADCAP<ADCAP0>
extern volatile __bit                   ADCAP0              __at(0x1F80);	// @ (0x3F0 * 8 + 0)
#define                                 ADCAP0_bit          _BIT_ACCESS(ADCAP,0)
// ADCAP<ADCAP1>
extern volatile __bit                   ADCAP1              __at(0x1F81);	// @ (0x3F0 * 8 + 1)
#define                                 ADCAP1_bit          _BIT_ACCESS(ADCAP,1)
// ADCAP<ADCAP2>
extern volatile __bit                   ADCAP2              __at(0x1F82);	// @ (0x3F0 * 8 + 2)
#define                                 ADCAP2_bit          _BIT_ACCESS(ADCAP,2)
// ADCAP<ADCAP3>
extern volatile __bit                   ADCAP3              __at(0x1F83);	// @ (0x3F0 * 8 + 3)
#define                                 ADCAP3_bit          _BIT_ACCESS(ADCAP,3)
// ADCAP<ADCAP4>
extern volatile __bit                   ADCAP4              __at(0x1F84);	// @ (0x3F0 * 8 + 4)
#define                                 ADCAP4_bit          _BIT_ACCESS(ADCAP,4)
// ADCGA<ADCGA0>
extern volatile __bit                   ADCGA0              __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 ADCGA0_bit          _BIT_ACCESS(ADCGA,0)
// ADCGA<ADCGA1>
extern volatile __bit                   ADCGA1              __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 ADCGA1_bit          _BIT_ACCESS(ADCGA,1)
// ADCGA<ADCGA2>
extern volatile __bit                   ADCGA2              __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 ADCGA2_bit          _BIT_ACCESS(ADCGA,2)
// ADCGA<ADCGA3>
extern volatile __bit                   ADCGA3              __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 ADCGA3_bit          _BIT_ACCESS(ADCGA,3)
// ADCGA<ADCGA4>
extern volatile __bit                   ADCGA4              __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 ADCGA4_bit          _BIT_ACCESS(ADCGA,4)
// ADCGA<ADCGA5>
extern volatile __bit                   ADCGA5              __at(0x885);	// @ (0x110 * 8 + 5)
#define                                 ADCGA5_bit          _BIT_ACCESS(ADCGA,5)
// ADCGA<ADCGA6>
extern volatile __bit                   ADCGA6              __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 ADCGA6_bit          _BIT_ACCESS(ADCGA,6)
// ADCGA<ADCGA7>
extern volatile __bit                   ADCGA7              __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 ADCGA7_bit          _BIT_ACCESS(ADCGA,7)
// ADCGB<ADCGB0>
extern volatile __bit                   ADCGB0              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 ADCGB0_bit          _BIT_ACCESS(ADCGB,0)
// ADCGB<ADCGB1>
extern volatile __bit                   ADCGB1              __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 ADCGB1_bit          _BIT_ACCESS(ADCGB,1)
// ADCGB<ADCGB2>
extern volatile __bit                   ADCGB2              __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 ADCGB2_bit          _BIT_ACCESS(ADCGB,2)
// ADCGB<ADCGB3>
extern volatile __bit                   ADCGB3              __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 ADCGB3_bit          _BIT_ACCESS(ADCGB,3)
// ADCGB<ADCGB4>
extern volatile __bit                   ADCGB4              __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 ADCGB4_bit          _BIT_ACCESS(ADCGB,4)
// ADCGB<ADCGB5>
extern volatile __bit                   ADCGB5              __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 ADCGB5_bit          _BIT_ACCESS(ADCGB,5)
// ADCGB<ADCGB6>
extern volatile __bit                   ADCGB6              __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 ADCGB6_bit          _BIT_ACCESS(ADCGB,6)
// ADCGB<ADCGB7>
extern volatile __bit                   ADCGB7              __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 ADCGB7_bit          _BIT_ACCESS(ADCGB,7)
// ADCGC<ADCGC0>
extern volatile __bit                   ADCGC0              __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 ADCGC0_bit          _BIT_ACCESS(ADCGC,0)
// ADCGC<ADCGC1>
extern volatile __bit                   ADCGC1              __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 ADCGC1_bit          _BIT_ACCESS(ADCGC,1)
// ADCGC<ADCGC2>
extern volatile __bit                   ADCGC2              __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 ADCGC2_bit          _BIT_ACCESS(ADCGC,2)
// ADCGC<ADCGC3>
extern volatile __bit                   ADCGC3              __at(0x893);	// @ (0x112 * 8 + 3)
#define                                 ADCGC3_bit          _BIT_ACCESS(ADCGC,3)
// ADCGC<ADCGC4>
extern volatile __bit                   ADCGC4              __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 ADCGC4_bit          _BIT_ACCESS(ADCGC,4)
// ADCGC<ADCGC5>
extern volatile __bit                   ADCGC5              __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 ADCGC5_bit          _BIT_ACCESS(ADCGC,5)
// ADCGC<ADCGC6>
extern volatile __bit                   ADCGC6              __at(0x896);	// @ (0x112 * 8 + 6)
#define                                 ADCGC6_bit          _BIT_ACCESS(ADCGC,6)
// ADCGC<ADCGC7>
extern volatile __bit                   ADCGC7              __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 ADCGC7_bit          _BIT_ACCESS(ADCGC,7)
// ADCGD<ADCGD0>
extern volatile __bit                   ADCGD0              __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 ADCGD0_bit          _BIT_ACCESS(ADCGD,0)
// ADCGD<ADCGD1>
extern volatile __bit                   ADCGD1              __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 ADCGD1_bit          _BIT_ACCESS(ADCGD,1)
// ADCGD<ADCGD2>
extern volatile __bit                   ADCGD2              __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 ADCGD2_bit          _BIT_ACCESS(ADCGD,2)
// ADCGD<ADCGD3>
extern volatile __bit                   ADCGD3              __at(0x89B);	// @ (0x113 * 8 + 3)
#define                                 ADCGD3_bit          _BIT_ACCESS(ADCGD,3)
// ADCGD<ADCGD4>
extern volatile __bit                   ADCGD4              __at(0x89C);	// @ (0x113 * 8 + 4)
#define                                 ADCGD4_bit          _BIT_ACCESS(ADCGD,4)
// ADCGD<ADCGD5>
extern volatile __bit                   ADCGD5              __at(0x89D);	// @ (0x113 * 8 + 5)
#define                                 ADCGD5_bit          _BIT_ACCESS(ADCGD,5)
// ADCGD<ADCGD6>
extern volatile __bit                   ADCGD6              __at(0x89E);	// @ (0x113 * 8 + 6)
#define                                 ADCGD6_bit          _BIT_ACCESS(ADCGD,6)
// ADCGD<ADCGD7>
extern volatile __bit                   ADCGD7              __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 ADCGD7_bit          _BIT_ACCESS(ADCGD,7)
// ADCGE<ADCGE0>
extern volatile __bit                   ADCGE0              __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 ADCGE0_bit          _BIT_ACCESS(ADCGE,0)
// ADCGE<ADCGE1>
extern volatile __bit                   ADCGE1              __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 ADCGE1_bit          _BIT_ACCESS(ADCGE,1)
// ADCGE<ADCGE2>
extern volatile __bit                   ADCGE2              __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 ADCGE2_bit          _BIT_ACCESS(ADCGE,2)
// PIE1<ADCH1IE>
extern volatile __bit                   ADCH1IE             __at(0x2541);	// @ (0x4A8 * 8 + 1)
#define                                 ADCH1IE_bit         _BIT_ACCESS(PIE1,1)
// PIR1<ADCH1IF>
extern volatile __bit                   ADCH1IF             __at(0x2599);	// @ (0x4B3 * 8 + 1)
#define                                 ADCH1IF_bit         _BIT_ACCESS(PIR1,1)
// IPR1<ADCH1IP>
extern volatile __bit                   ADCH1IP             __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 ADCH1IP_bit         _BIT_ACCESS(IPR1,1)
// PIE1<ADCH2IE>
extern volatile __bit                   ADCH2IE             __at(0x2545);	// @ (0x4A8 * 8 + 5)
#define                                 ADCH2IE_bit         _BIT_ACCESS(PIE1,5)
// PIR1<ADCH2IF>
extern volatile __bit                   ADCH2IF             __at(0x259D);	// @ (0x4B3 * 8 + 5)
#define                                 ADCH2IF_bit         _BIT_ACCESS(PIR1,5)
// IPR1<ADCH2IP>
extern volatile __bit                   ADCH2IP             __at(0x24ED);	// @ (0x49D * 8 + 5)
#define                                 ADCH2IP_bit         _BIT_ACCESS(IPR1,5)
// PIE1<ADCH3IE>
extern volatile __bit                   ADCH3IE             __at(0x2546);	// @ (0x4A8 * 8 + 6)
#define                                 ADCH3IE_bit         _BIT_ACCESS(PIE1,6)
// PIR1<ADCH3IF>
extern volatile __bit                   ADCH3IF             __at(0x259E);	// @ (0x4B3 * 8 + 6)
#define                                 ADCH3IF_bit         _BIT_ACCESS(PIR1,6)
// IPR1<ADCH3IP>
extern volatile __bit                   ADCH3IP             __at(0x24EE);	// @ (0x49D * 8 + 6)
#define                                 ADCH3IP_bit         _BIT_ACCESS(IPR1,6)
// PIE1<ADCH4IE>
extern volatile __bit                   ADCH4IE             __at(0x2547);	// @ (0x4A8 * 8 + 7)
#define                                 ADCH4IE_bit         _BIT_ACCESS(PIE1,7)
// PIR1<ADCH4IF>
extern volatile __bit                   ADCH4IF             __at(0x259F);	// @ (0x4B3 * 8 + 7)
#define                                 ADCH4IF_bit         _BIT_ACCESS(PIR1,7)
// IPR1<ADCH4IP>
extern volatile __bit                   ADCH4IP             __at(0x24EF);	// @ (0x49D * 8 + 7)
#define                                 ADCH4IP_bit         _BIT_ACCESS(IPR1,7)
// PMD2<ADCMD>
extern volatile __bit                   ADCMD               __at(0x321);	// @ (0x64 * 8 + 1)
#define                                 ADCMD_bit           _BIT_ACCESS(PMD2,1)
// ADCNT<ADCNT0>
extern volatile __bit                   ADCNT0              __at(0x1F30);	// @ (0x3E6 * 8 + 0)
#define                                 ADCNT0_bit          _BIT_ACCESS(ADCNT,0)
// ADCNT<ADCNT1>
extern volatile __bit                   ADCNT1              __at(0x1F31);	// @ (0x3E6 * 8 + 1)
#define                                 ADCNT1_bit          _BIT_ACCESS(ADCNT,1)
// ADCNT<ADCNT2>
extern volatile __bit                   ADCNT2              __at(0x1F32);	// @ (0x3E6 * 8 + 2)
#define                                 ADCNT2_bit          _BIT_ACCESS(ADCNT,2)
// ADCNT<ADCNT3>
extern volatile __bit                   ADCNT3              __at(0x1F33);	// @ (0x3E6 * 8 + 3)
#define                                 ADCNT3_bit          _BIT_ACCESS(ADCNT,3)
// ADCNT<ADCNT4>
extern volatile __bit                   ADCNT4              __at(0x1F34);	// @ (0x3E6 * 8 + 4)
#define                                 ADCNT4_bit          _BIT_ACCESS(ADCNT,4)
// ADCNT<ADCNT5>
extern volatile __bit                   ADCNT5              __at(0x1F35);	// @ (0x3E6 * 8 + 5)
#define                                 ADCNT5_bit          _BIT_ACCESS(ADCNT,5)
// ADCNT<ADCNT6>
extern volatile __bit                   ADCNT6              __at(0x1F36);	// @ (0x3E6 * 8 + 6)
#define                                 ADCNT6_bit          _BIT_ACCESS(ADCNT,6)
// ADCNT<ADCNT7>
extern volatile __bit                   ADCNT7              __at(0x1F37);	// @ (0x3E6 * 8 + 7)
#define                                 ADCNT7_bit          _BIT_ACCESS(ADCNT,7)
// ADCON0<ADCONT>
extern volatile __bit                   ADCONT              __at(0x1F9E);	// @ (0x3F3 * 8 + 6)
#define                                 ADCONT_bit          _BIT_ACCESS(ADCON0,6)
// ADCPCON<ADCPON>
extern volatile __bit                   ADCPON              __at(0x1EC7);	// @ (0x3D8 * 8 + 7)
#define                                 ADCPON_bit          _BIT_ACCESS(ADCPCON,7)
// ADCPCON<ADCPRDY>
extern volatile __bit                   ADCPRDY             __at(0x1EC0);	// @ (0x3D8 * 8 + 0)
#define                                 ADCPRDY_bit         _BIT_ACCESS(ADCPCON,0)
// ADCON2<ADCRS0>
extern volatile __bit                   ADCRS0              __at(0x1FAC);	// @ (0x3F5 * 8 + 4)
#define                                 ADCRS0_bit          _BIT_ACCESS(ADCON2,4)
// ADCON2<ADCRS1>
extern volatile __bit                   ADCRS1              __at(0x1FAD);	// @ (0x3F5 * 8 + 5)
#define                                 ADCRS1_bit          _BIT_ACCESS(ADCON2,5)
// ADCON2<ADCRS2>
extern volatile __bit                   ADCRS2              __at(0x1FAE);	// @ (0x3F5 * 8 + 6)
#define                                 ADCRS2_bit          _BIT_ACCESS(ADCON2,6)
// ADCON0<ADCS>
extern volatile __bit                   ADCS                __at(0x1F9C);	// @ (0x3F3 * 8 + 4)
#define                                 ADCS_bit            _BIT_ACCESS(ADCON0,4)
// ADCLK<ADCS0>
extern volatile __bit                   ADCS0               __at(0x1FD0);	// @ (0x3FA * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCLK,0)
// ADCLK<ADCS1>
extern volatile __bit                   ADCS1               __at(0x1FD1);	// @ (0x3FA * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCLK,1)
// ADCLK<ADCS2>
extern volatile __bit                   ADCS2               __at(0x1FD2);	// @ (0x3FA * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCLK,2)
// ADCLK<ADCS3>
extern volatile __bit                   ADCS3               __at(0x1FD3);	// @ (0x3FA * 8 + 3)
#define                                 ADCS3_bit           _BIT_ACCESS(ADCLK,3)
// ADCLK<ADCS4>
extern volatile __bit                   ADCS4               __at(0x1FD4);	// @ (0x3FA * 8 + 4)
#define                                 ADCS4_bit           _BIT_ACCESS(ADCLK,4)
// ADCLK<ADCS5>
extern volatile __bit                   ADCS5               __at(0x1FD5);	// @ (0x3FA * 8 + 5)
#define                                 ADCS5_bit           _BIT_ACCESS(ADCLK,5)
// ADCON0<ADCSEN>
extern volatile __bit                   ADCSEN              __at(0x1F9D);	// @ (0x3F3 * 8 + 5)
#define                                 ADCSEN_bit          _BIT_ACCESS(ADCON0,5)
// ADCTX<ADCTX0>
extern volatile __bit                   ADCTX0              __at(0x1FD8);	// @ (0x3FB * 8 + 0)
#define                                 ADCTX0_bit          _BIT_ACCESS(ADCTX,0)
// ADCTX<ADCTX1>
extern volatile __bit                   ADCTX1              __at(0x1FD9);	// @ (0x3FB * 8 + 1)
#define                                 ADCTX1_bit          _BIT_ACCESS(ADCTX,1)
// ADCTX<ADCTXSW>
extern volatile __bit                   ADCTXSW             __at(0x1FDF);	// @ (0x3FB * 8 + 7)
#define                                 ADCTXSW_bit         _BIT_ACCESS(ADCTX,7)
// ADCON1<ADDSEN>
extern volatile __bit                   ADDSEN              __at(0x1FA0);	// @ (0x3F4 * 8 + 0)
#define                                 ADDSEN_bit          _BIT_ACCESS(ADCON1,0)
// ADERRL<ADERR0>
extern volatile __bit                   ADERR0              __at(0x1EE8);	// @ (0x3DD * 8 + 0)
#define                                 ADERR0_bit          _BIT_ACCESS(ADERRL,0)
// ADERRL<ADERR1>
extern volatile __bit                   ADERR1              __at(0x1EE9);	// @ (0x3DD * 8 + 1)
#define                                 ADERR1_bit          _BIT_ACCESS(ADERRL,1)
// ADERRH<ADERR10>
extern volatile __bit                   ADERR10             __at(0x1EF2);	// @ (0x3DE * 8 + 2)
#define                                 ADERR10_bit         _BIT_ACCESS(ADERRH,2)
// ADERRH<ADERR11>
extern volatile __bit                   ADERR11             __at(0x1EF3);	// @ (0x3DE * 8 + 3)
#define                                 ADERR11_bit         _BIT_ACCESS(ADERRH,3)
// ADERRH<ADERR12>
extern volatile __bit                   ADERR12             __at(0x1EF4);	// @ (0x3DE * 8 + 4)
#define                                 ADERR12_bit         _BIT_ACCESS(ADERRH,4)
// ADERRH<ADERR13>
extern volatile __bit                   ADERR13             __at(0x1EF5);	// @ (0x3DE * 8 + 5)
#define                                 ADERR13_bit         _BIT_ACCESS(ADERRH,5)
// ADERRH<ADERR14>
extern volatile __bit                   ADERR14             __at(0x1EF6);	// @ (0x3DE * 8 + 6)
#define                                 ADERR14_bit         _BIT_ACCESS(ADERRH,6)
// ADERRH<ADERR15>
extern volatile __bit                   ADERR15             __at(0x1EF7);	// @ (0x3DE * 8 + 7)
#define                                 ADERR15_bit         _BIT_ACCESS(ADERRH,7)
// ADERRL<ADERR2>
extern volatile __bit                   ADERR2              __at(0x1EEA);	// @ (0x3DD * 8 + 2)
#define                                 ADERR2_bit          _BIT_ACCESS(ADERRL,2)
// ADERRL<ADERR3>
extern volatile __bit                   ADERR3              __at(0x1EEB);	// @ (0x3DD * 8 + 3)
#define                                 ADERR3_bit          _BIT_ACCESS(ADERRL,3)
// ADERRL<ADERR4>
extern volatile __bit                   ADERR4              __at(0x1EEC);	// @ (0x3DD * 8 + 4)
#define                                 ADERR4_bit          _BIT_ACCESS(ADERRL,4)
// ADERRL<ADERR5>
extern volatile __bit                   ADERR5              __at(0x1EED);	// @ (0x3DD * 8 + 5)
#define                                 ADERR5_bit          _BIT_ACCESS(ADERRL,5)
// ADERRL<ADERR6>
extern volatile __bit                   ADERR6              __at(0x1EEE);	// @ (0x3DD * 8 + 6)
#define                                 ADERR6_bit          _BIT_ACCESS(ADERRL,6)
// ADERRL<ADERR7>
extern volatile __bit                   ADERR7              __at(0x1EEF);	// @ (0x3DD * 8 + 7)
#define                                 ADERR7_bit          _BIT_ACCESS(ADERRL,7)
// ADERRH<ADERR8>
extern volatile __bit                   ADERR8              __at(0x1EF0);	// @ (0x3DE * 8 + 0)
#define                                 ADERR8_bit          _BIT_ACCESS(ADERRH,0)
// ADERRH<ADERR9>
extern volatile __bit                   ADERR9              __at(0x1EF1);	// @ (0x3DE * 8 + 1)
#define                                 ADERR9_bit          _BIT_ACCESS(ADERRH,1)
// ADFLTRL<ADFLTR0>
extern volatile __bit                   ADFLTR0             __at(0x1F08);	// @ (0x3E1 * 8 + 0)
#define                                 ADFLTR0_bit         _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<ADFLTR1>
extern volatile __bit                   ADFLTR1             __at(0x1F09);	// @ (0x3E1 * 8 + 1)
#define                                 ADFLTR1_bit         _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<ADFLTR10>
extern volatile __bit                   ADFLTR10            __at(0x1F12);	// @ (0x3E2 * 8 + 2)
#define                                 ADFLTR10_bit        _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<ADFLTR11>
extern volatile __bit                   ADFLTR11            __at(0x1F13);	// @ (0x3E2 * 8 + 3)
#define                                 ADFLTR11_bit        _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<ADFLTR12>
extern volatile __bit                   ADFLTR12            __at(0x1F14);	// @ (0x3E2 * 8 + 4)
#define                                 ADFLTR12_bit        _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<ADFLTR13>
extern volatile __bit                   ADFLTR13            __at(0x1F15);	// @ (0x3E2 * 8 + 5)
#define                                 ADFLTR13_bit        _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<ADFLTR14>
extern volatile __bit                   ADFLTR14            __at(0x1F16);	// @ (0x3E2 * 8 + 6)
#define                                 ADFLTR14_bit        _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<ADFLTR15>
extern volatile __bit                   ADFLTR15            __at(0x1F17);	// @ (0x3E2 * 8 + 7)
#define                                 ADFLTR15_bit        _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<ADFLTR2>
extern volatile __bit                   ADFLTR2             __at(0x1F0A);	// @ (0x3E1 * 8 + 2)
#define                                 ADFLTR2_bit         _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<ADFLTR3>
extern volatile __bit                   ADFLTR3             __at(0x1F0B);	// @ (0x3E1 * 8 + 3)
#define                                 ADFLTR3_bit         _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<ADFLTR4>
extern volatile __bit                   ADFLTR4             __at(0x1F0C);	// @ (0x3E1 * 8 + 4)
#define                                 ADFLTR4_bit         _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<ADFLTR5>
extern volatile __bit                   ADFLTR5             __at(0x1F0D);	// @ (0x3E1 * 8 + 5)
