garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
extern volatile __bit                   APMPERE2_14         __at(0xEBE);	// @ (0x1D7 * 8 + 6)
#define                                 APMPERE2_14_bit     _BIT_ACCESS(APMPERE2H,6)
// APMPERE2H<APMPERE2_15>
extern volatile __bit                   APMPERE2_15         __at(0xEBF);	// @ (0x1D7 * 8 + 7)
#define                                 APMPERE2_15_bit     _BIT_ACCESS(APMPERE2H,7)
// APMPERE2L<APMPERE2_2>
extern volatile __bit                   APMPERE2_2          __at(0xEB2);	// @ (0x1D6 * 8 + 2)
#define                                 APMPERE2_2_bit      _BIT_ACCESS(APMPERE2L,2)
// APMPERE2L<APMPERE2_3>
extern volatile __bit                   APMPERE2_3          __at(0xEB3);	// @ (0x1D6 * 8 + 3)
#define                                 APMPERE2_3_bit      _BIT_ACCESS(APMPERE2L,3)
// APMPERE2L<APMPERE2_4>
extern volatile __bit                   APMPERE2_4          __at(0xEB4);	// @ (0x1D6 * 8 + 4)
#define                                 APMPERE2_4_bit      _BIT_ACCESS(APMPERE2L,4)
// APMPERE2L<APMPERE2_5>
extern volatile __bit                   APMPERE2_5          __at(0xEB5);	// @ (0x1D6 * 8 + 5)
#define                                 APMPERE2_5_bit      _BIT_ACCESS(APMPERE2L,5)
// APMPERE2L<APMPERE2_6>
extern volatile __bit                   APMPERE2_6          __at(0xEB6);	// @ (0x1D6 * 8 + 6)
#define                                 APMPERE2_6_bit      _BIT_ACCESS(APMPERE2L,6)
// APMPERE2L<APMPERE2_7>
extern volatile __bit                   APMPERE2_7          __at(0xEB7);	// @ (0x1D6 * 8 + 7)
#define                                 APMPERE2_7_bit      _BIT_ACCESS(APMPERE2L,7)
// APMPERE2H<APMPERE2_8>
extern volatile __bit                   APMPERE2_8          __at(0xEB8);	// @ (0x1D7 * 8 + 0)
#define                                 APMPERE2_8_bit      _BIT_ACCESS(APMPERE2H,0)
// APMPERE2H<APMPERE2_9>
extern volatile __bit                   APMPERE2_9          __at(0xEB9);	// @ (0x1D7 * 8 + 1)
#define                                 APMPERE2_9_bit      _BIT_ACCESS(APMPERE2H,1)
// APMPERS1H<APMPERS1_10>
extern volatile __bit                   APMPERS1_10         __at(0xE42);	// @ (0x1C8 * 8 + 2)
#define                                 APMPERS1_10_bit     _BIT_ACCESS(APMPERS1H,2)
// APMPERS1H<APMPERS1_11>
extern volatile __bit                   APMPERS1_11         __at(0xE43);	// @ (0x1C8 * 8 + 3)
#define                                 APMPERS1_11_bit     _BIT_ACCESS(APMPERS1H,3)
// APMPERS1H<APMPERS1_12>
extern volatile __bit                   APMPERS1_12         __at(0xE44);	// @ (0x1C8 * 8 + 4)
#define                                 APMPERS1_12_bit     _BIT_ACCESS(APMPERS1H,4)
// APMPERS1H<APMPERS1_13>
extern volatile __bit                   APMPERS1_13         __at(0xE45);	// @ (0x1C8 * 8 + 5)
#define                                 APMPERS1_13_bit     _BIT_ACCESS(APMPERS1H,5)
// APMPERS1H<APMPERS1_14>
extern volatile __bit                   APMPERS1_14         __at(0xE46);	// @ (0x1C8 * 8 + 6)
#define                                 APMPERS1_14_bit     _BIT_ACCESS(APMPERS1H,6)
// APMPERS1H<APMPERS1_15>
extern volatile __bit                   APMPERS1_15         __at(0xE47);	// @ (0x1C8 * 8 + 7)
#define                                 APMPERS1_15_bit     _BIT_ACCESS(APMPERS1H,7)
// APMPERS1L<APMPERS1_2>
extern volatile __bit                   APMPERS1_2          __at(0xE3A);	// @ (0x1C7 * 8 + 2)
#define                                 APMPERS1_2_bit      _BIT_ACCESS(APMPERS1L,2)
// APMPERS1L<APMPERS1_3>
extern volatile __bit                   APMPERS1_3          __at(0xE3B);	// @ (0x1C7 * 8 + 3)
#define                                 APMPERS1_3_bit      _BIT_ACCESS(APMPERS1L,3)
// APMPERS1L<APMPERS1_4>
extern volatile __bit                   APMPERS1_4          __at(0xE3C);	// @ (0x1C7 * 8 + 4)
#define                                 APMPERS1_4_bit      _BIT_ACCESS(APMPERS1L,4)
// APMPERS1L<APMPERS1_5>
extern volatile __bit                   APMPERS1_5          __at(0xE3D);	// @ (0x1C7 * 8 + 5)
#define                                 APMPERS1_5_bit      _BIT_ACCESS(APMPERS1L,5)
// APMPERS1L<APMPERS1_6>
extern volatile __bit                   APMPERS1_6          __at(0xE3E);	// @ (0x1C7 * 8 + 6)
#define                                 APMPERS1_6_bit      _BIT_ACCESS(APMPERS1L,6)
// APMPERS1L<APMPERS1_7>
extern volatile __bit                   APMPERS1_7          __at(0xE3F);	// @ (0x1C7 * 8 + 7)
#define                                 APMPERS1_7_bit      _BIT_ACCESS(APMPERS1L,7)
// APMPERS1H<APMPERS1_8>
extern volatile __bit                   APMPERS1_8          __at(0xE40);	// @ (0x1C8 * 8 + 0)
#define                                 APMPERS1_8_bit      _BIT_ACCESS(APMPERS1H,0)
// APMPERS1H<APMPERS1_9>
extern volatile __bit                   APMPERS1_9          __at(0xE41);	// @ (0x1C8 * 8 + 1)
#define                                 APMPERS1_9_bit      _BIT_ACCESS(APMPERS1H,1)
// APMPERS2H<APMPERS2_10>
extern volatile __bit                   APMPERS2_10         __at(0xE6A);	// @ (0x1CD * 8 + 2)
#define                                 APMPERS2_10_bit     _BIT_ACCESS(APMPERS2H,2)
// APMPERS2H<APMPERS2_11>
extern volatile __bit                   APMPERS2_11         __at(0xE6B);	// @ (0x1CD * 8 + 3)
#define                                 APMPERS2_11_bit     _BIT_ACCESS(APMPERS2H,3)
// APMPERS2H<APMPERS2_12>
extern volatile __bit                   APMPERS2_12         __at(0xE6C);	// @ (0x1CD * 8 + 4)
#define                                 APMPERS2_12_bit     _BIT_ACCESS(APMPERS2H,4)
// APMPERS2H<APMPERS2_13>
extern volatile __bit                   APMPERS2_13         __at(0xE6D);	// @ (0x1CD * 8 + 5)
#define                                 APMPERS2_13_bit     _BIT_ACCESS(APMPERS2H,5)
// APMPERS2H<APMPERS2_14>
extern volatile __bit                   APMPERS2_14         __at(0xE6E);	// @ (0x1CD * 8 + 6)
#define                                 APMPERS2_14_bit     _BIT_ACCESS(APMPERS2H,6)
// APMPERS2H<APMPERS2_15>
extern volatile __bit                   APMPERS2_15         __at(0xE6F);	// @ (0x1CD * 8 + 7)
#define                                 APMPERS2_15_bit     _BIT_ACCESS(APMPERS2H,7)
// APMPERS2L<APMPERS2_2>
extern volatile __bit                   APMPERS2_2          __at(0xE62);	// @ (0x1CC * 8 + 2)
#define                                 APMPERS2_2_bit      _BIT_ACCESS(APMPERS2L,2)
// APMPERS2L<APMPERS2_3>
extern volatile __bit                   APMPERS2_3          __at(0xE63);	// @ (0x1CC * 8 + 3)
#define                                 APMPERS2_3_bit      _BIT_ACCESS(APMPERS2L,3)
// APMPERS2L<APMPERS2_4>
extern volatile __bit                   APMPERS2_4          __at(0xE64);	// @ (0x1CC * 8 + 4)
#define                                 APMPERS2_4_bit      _BIT_ACCESS(APMPERS2L,4)
// APMPERS2L<APMPERS2_5>
extern volatile __bit                   APMPERS2_5          __at(0xE65);	// @ (0x1CC * 8 + 5)
#define                                 APMPERS2_5_bit      _BIT_ACCESS(APMPERS2L,5)
// APMPERS2L<APMPERS2_6>
extern volatile __bit                   APMPERS2_6          __at(0xE66);	// @ (0x1CC * 8 + 6)
#define                                 APMPERS2_6_bit      _BIT_ACCESS(APMPERS2L,6)
// APMPERS2L<APMPERS2_7>
extern volatile __bit                   APMPERS2_7          __at(0xE67);	// @ (0x1CC * 8 + 7)
#define                                 APMPERS2_7_bit      _BIT_ACCESS(APMPERS2L,7)
// APMPERS2H<APMPERS2_8>
extern volatile __bit                   APMPERS2_8          __at(0xE68);	// @ (0x1CD * 8 + 0)
#define                                 APMPERS2_8_bit      _BIT_ACCESS(APMPERS2H,0)
// APMPERS2H<APMPERS2_9>
extern volatile __bit                   APMPERS2_9          __at(0xE69);	// @ (0x1CD * 8 + 1)
#define                                 APMPERS2_9_bit      _BIT_ACCESS(APMPERS2H,1)
// APMPREL<APMPRE0>
extern volatile __bit                   APMPRE0             __at(0xE08);	// @ (0x1C1 * 8 + 0)
#define                                 APMPRE0_bit         _BIT_ACCESS(APMPREL,0)
// APMPREL<APMPRE1>
extern volatile __bit                   APMPRE1             __at(0xE09);	// @ (0x1C1 * 8 + 1)
#define                                 APMPRE1_bit         _BIT_ACCESS(APMPREL,1)
// APMPREH<APMPRE10>
extern volatile __bit                   APMPRE10            __at(0xE12);	// @ (0x1C2 * 8 + 2)
#define                                 APMPRE10_bit        _BIT_ACCESS(APMPREH,2)
// APMPREH<APMPRE11>
extern volatile __bit                   APMPRE11            __at(0xE13);	// @ (0x1C2 * 8 + 3)
#define                                 APMPRE11_bit        _BIT_ACCESS(APMPREH,3)
// APMPREH<APMPRE12>
extern volatile __bit                   APMPRE12            __at(0xE14);	// @ (0x1C2 * 8 + 4)
#define                                 APMPRE12_bit        _BIT_ACCESS(APMPREH,4)
// APMPREH<APMPRE13>
extern volatile __bit                   APMPRE13            __at(0xE15);	// @ (0x1C2 * 8 + 5)
#define                                 APMPRE13_bit        _BIT_ACCESS(APMPREH,5)
// APMPREH<APMPRE14>
extern volatile __bit                   APMPRE14            __at(0xE16);	// @ (0x1C2 * 8 + 6)
#define                                 APMPRE14_bit        _BIT_ACCESS(APMPREH,6)
// APMPREH<APMPRE15>
extern volatile __bit                   APMPRE15            __at(0xE17);	// @ (0x1C2 * 8 + 7)
#define                                 APMPRE15_bit        _BIT_ACCESS(APMPREH,7)
// APMPREL<APMPRE2>
extern volatile __bit                   APMPRE2             __at(0xE0A);	// @ (0x1C1 * 8 + 2)
#define                                 APMPRE2_bit         _BIT_ACCESS(APMPREL,2)
// APMPREL<APMPRE3>
extern volatile __bit                   APMPRE3             __at(0xE0B);	// @ (0x1C1 * 8 + 3)
#define                                 APMPRE3_bit         _BIT_ACCESS(APMPREL,3)
// APMPREL<APMPRE4>
extern volatile __bit                   APMPRE4             __at(0xE0C);	// @ (0x1C1 * 8 + 4)
#define                                 APMPRE4_bit         _BIT_ACCESS(APMPREL,4)
// APMPREL<APMPRE5>
extern volatile __bit                   APMPRE5             __at(0xE0D);	// @ (0x1C1 * 8 + 5)
#define                                 APMPRE5_bit         _BIT_ACCESS(APMPREL,5)
// APMPREL<APMPRE6>
extern volatile __bit                   APMPRE6             __at(0xE0E);	// @ (0x1C1 * 8 + 6)
#define                                 APMPRE6_bit         _BIT_ACCESS(APMPREL,6)
// APMPREL<APMPRE7>
extern volatile __bit                   APMPRE7             __at(0xE0F);	// @ (0x1C1 * 8 + 7)
#define                                 APMPRE7_bit         _BIT_ACCESS(APMPREL,7)
// APMPREH<APMPRE8>
extern volatile __bit                   APMPRE8             __at(0xE10);	// @ (0x1C2 * 8 + 0)
#define                                 APMPRE8_bit         _BIT_ACCESS(APMPREH,0)
// APMPREH<APMPRE9>
extern volatile __bit                   APMPRE9             __at(0xE11);	// @ (0x1C2 * 8 + 1)
#define                                 APMPRE9_bit         _BIT_ACCESS(APMPREH,1)
// APMSTATUSH<APMSTATUS_10>
extern volatile __bit                   APMSTATUS_10        __at(0xED2);	// @ (0x1DA * 8 + 2)
#define                                 APMSTATUS_10_bit    _BIT_ACCESS(APMSTATUSH,2)
// APMSTATUSH<APMSTATUS_11>
extern volatile __bit                   APMSTATUS_11        __at(0xED3);	// @ (0x1DA * 8 + 3)
#define                                 APMSTATUS_11_bit    _BIT_ACCESS(APMSTATUSH,3)
// APMSTATUSH<APMSTATUS_12>
extern volatile __bit                   APMSTATUS_12        __at(0xED4);	// @ (0x1DA * 8 + 4)
#define                                 APMSTATUS_12_bit    _BIT_ACCESS(APMSTATUSH,4)
// APMSTATUSH<APMSTATUS_13>
extern volatile __bit                   APMSTATUS_13        __at(0xED5);	// @ (0x1DA * 8 + 5)
#define                                 APMSTATUS_13_bit    _BIT_ACCESS(APMSTATUSH,5)
// APMSTATUSH<APMSTATUS_14>
extern volatile __bit                   APMSTATUS_14        __at(0xED6);	// @ (0x1DA * 8 + 6)
#define                                 APMSTATUS_14_bit    _BIT_ACCESS(APMSTATUSH,6)
// APMSTATUSH<APMSTATUS_15>
extern volatile __bit                   APMSTATUS_15        __at(0xED7);	// @ (0x1DA * 8 + 7)
#define                                 APMSTATUS_15_bit    _BIT_ACCESS(APMSTATUSH,7)
// APMSTATUSL<APMSTATUS_2>
extern volatile __bit                   APMSTATUS_2         __at(0xECA);	// @ (0x1D9 * 8 + 2)
#define                                 APMSTATUS_2_bit     _BIT_ACCESS(APMSTATUSL,2)
// APMSTATUSL<APMSTATUS_3>
extern volatile __bit                   APMSTATUS_3         __at(0xECB);	// @ (0x1D9 * 8 + 3)
#define                                 APMSTATUS_3_bit     _BIT_ACCESS(APMSTATUSL,3)
// APMSTATUSL<APMSTATUS_4>
extern volatile __bit                   APMSTATUS_4         __at(0xECC);	// @ (0x1D9 * 8 + 4)
#define                                 APMSTATUS_4_bit     _BIT_ACCESS(APMSTATUSL,4)
// APMSTATUSL<APMSTATUS_5>
extern volatile __bit                   APMSTATUS_5         __at(0xECD);	// @ (0x1D9 * 8 + 5)
#define                                 APMSTATUS_5_bit     _BIT_ACCESS(APMSTATUSL,5)
// APMSTATUSL<APMSTATUS_6>
extern volatile __bit                   APMSTATUS_6         __at(0xECE);	// @ (0x1D9 * 8 + 6)
#define                                 APMSTATUS_6_bit     _BIT_ACCESS(APMSTATUSL,6)
// APMSTATUSL<APMSTATUS_7>
extern volatile __bit                   APMSTATUS_7         __at(0xECF);	// @ (0x1D9 * 8 + 7)
#define                                 APMSTATUS_7_bit     _BIT_ACCESS(APMSTATUSL,7)
// APMSTATUSH<APMSTATUS_8>
extern volatile __bit                   APMSTATUS_8         __at(0xED0);	// @ (0x1DA * 8 + 0)
#define                                 APMSTATUS_8_bit     _BIT_ACCESS(APMSTATUSH,0)
// APMSTATUSH<APMSTATUS_9>
extern volatile __bit                   APMSTATUS_9         __at(0xED1);	// @ (0x1DA * 8 + 1)
#define                                 APMSTATUS_9_bit     _BIT_ACCESS(APMSTATUSH,1)
// CWG1AS1<AS0E>
extern volatile __bit                   AS0E                __at(0x1E18);	// @ (0x3C3 * 8 + 0)
#define                                 AS0E_bit            _BIT_ACCESS(CWG1AS1,0)
// CWG1AS1<AS1E>
extern volatile __bit                   AS1E                __at(0x1E19);	// @ (0x3C3 * 8 + 1)
#define                                 AS1E_bit            _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<AS2E>
extern volatile __bit                   AS2E                __at(0x1E1A);	// @ (0x3C3 * 8 + 2)
#define                                 AS2E_bit            _BIT_ACCESS(CWG1AS1,2)
// CWG1AS1<AS3E>
extern volatile __bit                   AS3E                __at(0x1E1B);	// @ (0x3C3 * 8 + 3)
#define                                 AS3E_bit            _BIT_ACCESS(CWG1AS1,3)
// CWG1AS1<AS4E>
extern volatile __bit                   AS4E                __at(0x1E1C);	// @ (0x3C3 * 8 + 4)
#define                                 AS4E_bit            _BIT_ACCESS(CWG1AS1,4)
// CWG1AS1<AS5E>
extern volatile __bit                   AS5E                __at(0x1E1D);	// @ (0x3C3 * 8 + 5)
#define                                 AS5E_bit            _BIT_ACCESS(CWG1AS1,5)
// CWG1AS1<AS6E>
extern volatile __bit                   AS6E                __at(0x1E1E);	// @ (0x3C3 * 8 + 6)
#define                                 AS6E_bit            _BIT_ACCESS(CWG1AS1,6)
// CWG1AS1<AS7E>
extern volatile __bit                   AS7E                __at(0x1E1F);	// @ (0x3C3 * 8 + 7)
#define                                 AS7E_bit            _BIT_ACCESS(CWG1AS1,7)
// T0CON1<ASYNC>
extern volatile __bit                   ASYNC               __at(0x18DC);	// @ (0x31B * 8 + 4)
#define                                 ASYNC_bit           _BIT_ACCESS(T0CON1,4)
// IVTBASEL<BASE0>
extern volatile __bit                   BASE0               __at(0x22E8);	// @ (0x45D * 8 + 0)
#define                                 BASE0_bit           _BIT_ACCESS(IVTBASEL,0)
// IVTBASEL<BASE1>
extern volatile __bit                   BASE1               __at(0x22E9);	// @ (0x45D * 8 + 1)
#define                                 BASE1_bit           _BIT_ACCESS(IVTBASEL,1)
// IVTBASEH<BASE10>
extern volatile __bit                   BASE10              __at(0x22F2);	// @ (0x45E * 8 + 2)
#define                                 BASE10_bit          _BIT_ACCESS(IVTBASEH,2)
// IVTBASEH<BASE11>
extern volatile __bit                   BASE11              __at(0x22F3);	// @ (0x45E * 8 + 3)
#define                                 BASE11_bit          _BIT_ACCESS(IVTBASEH,3)
// IVTBASEH<BASE12>
extern volatile __bit                   BASE12              __at(0x22F4);	// @ (0x45E * 8 + 4)
#define                                 BASE12_bit          _BIT_ACCESS(IVTBASEH,4)
// IVTBASEH<BASE13>
extern volatile __bit                   BASE13              __at(0x22F5);	// @ (0x45E * 8 + 5)
#define                                 BASE13_bit          _BIT_ACCESS(IVTBASEH,5)
// IVTBASEH<BASE14>
extern volatile __bit                   BASE14              __at(0x22F6);	// @ (0x45E * 8 + 6)
#define                                 BASE14_bit          _BIT_ACCESS(IVTBASEH,6)
// IVTBASEH<BASE15>
extern volatile __bit                   BASE15              __at(0x22F7);	// @ (0x45E * 8 + 7)
#define                                 BASE15_bit          _BIT_ACCESS(IVTBASEH,7)
// IVTBASEU<BASE16>
extern volatile __bit                   BASE16              __at(0x22F8);	// @ (0x45F * 8 + 0)
#define                                 BASE16_bit          _BIT_ACCESS(IVTBASEU,0)
// IVTBASEU<BASE17>
extern volatile __bit                   BASE17              __at(0x22F9);	// @ (0x45F * 8 + 1)
#define                                 BASE17_bit          _BIT_ACCESS(IVTBASEU,1)
// IVTBASEU<BASE18>
extern volatile __bit                   BASE18              __at(0x22FA);	// @ (0x45F * 8 + 2)
#define                                 BASE18_bit          _BIT_ACCESS(IVTBASEU,2)
// IVTBASEU<BASE19>
extern volatile __bit                   BASE19              __at(0x22FB);	// @ (0x45F * 8 + 3)
#define                                 BASE19_bit          _BIT_ACCESS(IVTBASEU,3)
// IVTBASEL<BASE2>
extern volatile __bit                   BASE2               __at(0x22EA);	// @ (0x45D * 8 + 2)
#define                                 BASE2_bit           _BIT_ACCESS(IVTBASEL,2)
// IVTBASEU<BASE20>
extern volatile __bit                   BASE20              __at(0x22FC);	// @ (0x45F * 8 + 4)
#define                                 BASE20_bit          _BIT_ACCESS(IVTBASEU,4)
// IVTBASEL<BASE3>
extern volatile __bit                   BASE3               __at(0x22EB);	// @ (0x45D * 8 + 3)
#define                                 BASE3_bit           _BIT_ACCESS(IVTBASEL,3)
// IVTBASEL<BASE4>
extern volatile __bit                   BASE4               __at(0x22EC);	// @ (0x45D * 8 + 4)
#define                                 BASE4_bit           _BIT_ACCESS(IVTBASEL,4)
// IVTBASEL<BASE5>
extern volatile __bit                   BASE5               __at(0x22ED);	// @ (0x45D * 8 + 5)
#define                                 BASE5_bit           _BIT_ACCESS(IVTBASEL,5)
// IVTBASEL<BASE6>
extern volatile __bit                   BASE6               __at(0x22EE);	// @ (0x45D * 8 + 6)
#define                                 BASE6_bit           _BIT_ACCESS(IVTBASEL,6)
// IVTBASEL<BASE7>
extern volatile __bit                   BASE7               __at(0x22EF);	// @ (0x45D * 8 + 7)
#define                                 BASE7_bit           _BIT_ACCESS(IVTBASEL,7)
// IVTBASEH<BASE8>
extern volatile __bit                   BASE8               __at(0x22F0);	// @ (0x45E * 8 + 0)
#define                                 BASE8_bit           _BIT_ACCESS(IVTBASEH,0)
// IVTBASEH<BASE9>
extern volatile __bit                   BASE9               __at(0x22F1);	// @ (0x45E * 8 + 1)
#define                                 BASE9_bit           _BIT_ACCESS(IVTBASEH,1)
// SPI1BAUD<BAUD0>
extern volatile __bit                   BAUD0               __at(0x448);	// @ (0x89 * 8 + 0)
#define                                 BAUD0_bit           _BIT_ACCESS(SPI1BAUD,0)
// SPI1BAUD<BAUD1>
extern volatile __bit                   BAUD1               __at(0x449);	// @ (0x89 * 8 + 1)
#define                                 BAUD1_bit           _BIT_ACCESS(SPI1BAUD,1)
// SPI1BAUD<BAUD2>
extern volatile __bit                   BAUD2               __at(0x44A);	// @ (0x89 * 8 + 2)
#define                                 BAUD2_bit           _BIT_ACCESS(SPI1BAUD,2)
// SPI1BAUD<BAUD3>
extern volatile __bit                   BAUD3               __at(0x44B);	// @ (0x89 * 8 + 3)
#define                                 BAUD3_bit           _BIT_ACCESS(SPI1BAUD,3)
// SPI1BAUD<BAUD4>
extern volatile __bit                   BAUD4               __at(0x44C);	// @ (0x89 * 8 + 4)
#define                                 BAUD4_bit           _BIT_ACCESS(SPI1BAUD,4)
// SPI1BAUD<BAUD5>
extern volatile __bit                   BAUD5               __at(0x44D);	// @ (0x89 * 8 + 5)
#define                                 BAUD5_bit           _BIT_ACCESS(SPI1BAUD,5)
// SPI1BAUD<BAUD6>
extern volatile __bit                   BAUD6               __at(0x44E);	// @ (0x89 * 8 + 6)
#define                                 BAUD6_bit           _BIT_ACCESS(SPI1BAUD,6)
// SPI1BAUD<BAUD7>
extern volatile __bit                   BAUD7               __at(0x44F);	// @ (0x89 * 8 + 7)
#define                                 BAUD7_bit           _BIT_ACCESS(SPI1BAUD,7)
// I2C1ERR<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(I2C1ERR,1)
// I2C1ERR<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 BCL1IF_bit          _BIT_ACCESS(I2C1ERR,5)
// I2C1ERR<BCLIE>
extern volatile __bit                   BCLIE               __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 BCLIE_bit           _BIT_ACCESS(I2C1ERR,1)
// I2C1ERR<BCLIF>
extern volatile __bit                   BCLIF               __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 BCLIF_bit           _BIT_ACCESS(I2C1ERR,5)
// I2C1STAT0<BFRE>
extern volatile __bit                   BFRE                __at(0x14C7);	// @ (0x298 * 8 + 7)
#define                                 BFRE_bit            _BIT_ACCESS(I2C1STAT0,7)
// I2C1CON2<BFRET0>
extern volatile __bit                   BFRET0              __at(0x14A8);	// @ (0x295 * 8 + 0)
#define                                 BFRET0_bit          _BIT_ACCESS(I2C1CON2,0)
// I2C1CON2<BFRET1>
extern volatile __bit                   BFRET1              __at(0x14A9);	// @ (0x295 * 8 + 1)
#define                                 BFRET1_bit          _BIT_ACCESS(I2C1CON2,1)
// SPI1CON0<BMODE>
extern volatile __bit                   BMODE               __at(0x420);	// @ (0x84 * 8 + 0)
#define                                 BMODE_bit           _BIT_ACCESS(SPI1CON0,0)
// PCON0<BOR>
extern volatile __bit                   BOR                 __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(PCON0,0)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x248);	// @ (0x49 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// I2C1ERR<BTO1IE>
extern volatile __bit                   BTO1IE              __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 BTO1IE_bit          _BIT_ACCESS(I2C1ERR,2)
// I2C1ERR<BTO1IF>
extern volatile __bit                   BTO1IF              __at(0x14BE);	// @ (0x297 * 8 + 6)
#define                                 BTO1IF_bit          _BIT_ACCESS(I2C1ERR,6)
// I2C1BTOC<BTOC0>
extern volatile __bit                   BTOC0               __at(0x14F8);	// @ (0x29F * 8 + 0)
#define                                 BTOC0_bit           _BIT_ACCESS(I2C1BTOC,0)
// I2C1BTOC<BTOC1>
extern volatile __bit                   BTOC1               __at(0x14F9);	// @ (0x29F * 8 + 1)
