garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f44q71.h
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x21C);	// @ (0x43 * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x21D);	// @ (0x43 * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x21E);	// @ (0x43 * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x21F);	// @ (0x43 * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x220);	// @ (0x44 * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x221);	// @ (0x44 * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x230);	// @ (0x46 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x231);	// @ (0x46 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0x23A);	// @ (0x47 * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0x23B);	// @ (0x47 * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0x23C);	// @ (0x47 * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0x23D);	// @ (0x47 * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATH<NVMDAT14>
extern volatile __bit                   NVMDAT14            __at(0x23E);	// @ (0x47 * 8 + 6)
#define                                 NVMDAT14_bit        _BIT_ACCESS(NVMDATH,6)
// NVMDATH<NVMDAT15>
extern volatile __bit                   NVMDAT15            __at(0x23F);	// @ (0x47 * 8 + 7)
#define                                 NVMDAT15_bit        _BIT_ACCESS(NVMDATH,7)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x232);	// @ (0x46 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x233);	// @ (0x46 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x234);	// @ (0x46 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x235);	// @ (0x46 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x236);	// @ (0x46 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x237);	// @ (0x46 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0x238);	// @ (0x47 * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0x239);	// @ (0x47 * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// NVMCON0<NVMGO>
extern volatile __bit                   NVMGO               __at(0x200);	// @ (0x40 * 8 + 0)
#define                                 NVMGO_bit           _BIT_ACCESS(NVMCON0,0)
// PIE0<NVMIE>
extern volatile __bit                   NVMIE               __at(0x253C);	// @ (0x4A7 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE0,4)
// PIR0<NVMIF>
extern volatile __bit                   NVMIF               __at(0x2594);	// @ (0x4B2 * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR0,4)
// IPR0<NVMIP>
extern volatile __bit                   NVMIP               __at(0x24E4);	// @ (0x49C * 8 + 4)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR0,4)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x2010);	// @ (0x402 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x2011);	// @ (0x402 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x2012);	// @ (0x402 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x2013);	// @ (0x402 * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x2014);	// @ (0x402 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x2015);	// @ (0x402 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x2016);	// @ (0x402 * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x2017);	// @ (0x402 * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x2050);	// @ (0x40A * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x2051);	// @ (0x40A * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x2052);	// @ (0x40A * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x2053);	// @ (0x40A * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x2054);	// @ (0x40A * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x2055);	// @ (0x40A * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x2056);	// @ (0x40A * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x2057);	// @ (0x40A * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x2090);	// @ (0x412 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x2091);	// @ (0x412 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x2092);	// @ (0x412 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x2093);	// @ (0x412 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x2094);	// @ (0x412 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x2095);	// @ (0x412 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x2096);	// @ (0x412 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x2097);	// @ (0x412 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// ODCOND<ODCD0>
extern volatile __bit                   ODCD0               __at(0x20D0);	// @ (0x41A * 8 + 0)
#define                                 ODCD0_bit           _BIT_ACCESS(ODCOND,0)
// ODCOND<ODCD1>
extern volatile __bit                   ODCD1               __at(0x20D1);	// @ (0x41A * 8 + 1)
#define                                 ODCD1_bit           _BIT_ACCESS(ODCOND,1)
// ODCOND<ODCD2>
extern volatile __bit                   ODCD2               __at(0x20D2);	// @ (0x41A * 8 + 2)
#define                                 ODCD2_bit           _BIT_ACCESS(ODCOND,2)
// ODCOND<ODCD3>
extern volatile __bit                   ODCD3               __at(0x20D3);	// @ (0x41A * 8 + 3)
#define                                 ODCD3_bit           _BIT_ACCESS(ODCOND,3)
// ODCOND<ODCD4>
extern volatile __bit                   ODCD4               __at(0x20D4);	// @ (0x41A * 8 + 4)
#define                                 ODCD4_bit           _BIT_ACCESS(ODCOND,4)
// ODCOND<ODCD5>
extern volatile __bit                   ODCD5               __at(0x20D5);	// @ (0x41A * 8 + 5)
#define                                 ODCD5_bit           _BIT_ACCESS(ODCOND,5)
// ODCOND<ODCD6>
extern volatile __bit                   ODCD6               __at(0x20D6);	// @ (0x41A * 8 + 6)
#define                                 ODCD6_bit           _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0x20D7);	// @ (0x41A * 8 + 7)
#define                                 ODCD7_bit           _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0x2110);	// @ (0x422 * 8 + 0)
#define                                 ODCE0_bit           _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0x2111);	// @ (0x422 * 8 + 1)
#define                                 ODCE1_bit           _BIT_ACCESS(ODCONE,1)
// ODCONE<ODCE2>
extern volatile __bit                   ODCE2               __at(0x2112);	// @ (0x422 * 8 + 2)
#define                                 ODCE2_bit           _BIT_ACCESS(ODCONE,2)
// OPA1CON0<OPA1CPON>
extern volatile __bit                   OPA1CPON            __at(0x8FD);	// @ (0x11F * 8 + 5)
#define                                 OPA1CPON_bit        _BIT_ACCESS(OPA1CON0,5)
// OPA1CON0<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x8FF);	// @ (0x11F * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON0,7)
// OPA1CON3<OPA1FMS0>
extern volatile __bit                   OPA1FMS0            __at(0x916);	// @ (0x122 * 8 + 6)
#define                                 OPA1FMS0_bit        _BIT_ACCESS(OPA1CON3,6)
// OPA1CON3<OPA1FMS1>
extern volatile __bit                   OPA1FMS1            __at(0x917);	// @ (0x122 * 8 + 7)
#define                                 OPA1FMS1_bit        _BIT_ACCESS(OPA1CON3,7)
// OPA1CON1<OPA1GSEL0>
extern volatile __bit                   OPA1GSEL0           __at(0x904);	// @ (0x120 * 8 + 4)
#define                                 OPA1GSEL0_bit       _BIT_ACCESS(OPA1CON1,4)
// OPA1CON1<OPA1GSEL1>
extern volatile __bit                   OPA1GSEL1           __at(0x905);	// @ (0x120 * 8 + 5)
#define                                 OPA1GSEL1_bit       _BIT_ACCESS(OPA1CON1,5)
// OPA1CON1<OPA1GSEL2>
extern volatile __bit                   OPA1GSEL2           __at(0x906);	// @ (0x120 * 8 + 6)
#define                                 OPA1GSEL2_bit       _BIT_ACCESS(OPA1CON1,6)
// OPA1HWC<OPA1HWCH0>
extern volatile __bit                   OPA1HWCH0           __at(0x924);	// @ (0x124 * 8 + 4)
#define                                 OPA1HWCH0_bit       _BIT_ACCESS(OPA1HWC,4)
// OPA1HWC<OPA1HWCH1>
extern volatile __bit                   OPA1HWCH1           __at(0x925);	// @ (0x124 * 8 + 5)
#define                                 OPA1HWCH1_bit       _BIT_ACCESS(OPA1HWC,5)
// OPA1HWC<OPA1HWCH2>
extern volatile __bit                   OPA1HWCH2           __at(0x926);	// @ (0x124 * 8 + 6)
#define                                 OPA1HWCH2_bit       _BIT_ACCESS(OPA1HWC,6)
// OPA1HWC<OPA1HWCL0>
extern volatile __bit                   OPA1HWCL0           __at(0x920);	// @ (0x124 * 8 + 0)
#define                                 OPA1HWCL0_bit       _BIT_ACCESS(OPA1HWC,0)
// OPA1HWC<OPA1HWCL1>
extern volatile __bit                   OPA1HWCL1           __at(0x921);	// @ (0x124 * 8 + 1)
#define                                 OPA1HWCL1_bit       _BIT_ACCESS(OPA1HWC,1)
// OPA1HWC<OPA1HWCL2>
extern volatile __bit                   OPA1HWCL2           __at(0x922);	// @ (0x124 * 8 + 2)
#define                                 OPA1HWCL2_bit       _BIT_ACCESS(OPA1HWC,2)
// OPA1CON3<OPA1INTOE>
extern volatile __bit                   OPA1INTOE           __at(0x915);	// @ (0x122 * 8 + 5)
#define                                 OPA1INTOE_bit       _BIT_ACCESS(OPA1CON3,5)
// PMD5<OPA1MD>
extern volatile __bit                   OPA1MD              __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 OPA1MD_bit          _BIT_ACCESS(PMD5,2)
// OPA1CON2<OPA1NCH0>
extern volatile __bit                   OPA1NCH0            __at(0x90C);	// @ (0x121 * 8 + 4)
#define                                 OPA1NCH0_bit        _BIT_ACCESS(OPA1CON2,4)
// OPA1CON2<OPA1NCH1>
extern volatile __bit                   OPA1NCH1            __at(0x90D);	// @ (0x121 * 8 + 5)
#define                                 OPA1NCH1_bit        _BIT_ACCESS(OPA1CON2,5)
// OPA1CON2<OPA1NCH2>
extern volatile __bit                   OPA1NCH2            __at(0x90E);	// @ (0x121 * 8 + 6)
#define                                 OPA1NCH2_bit        _BIT_ACCESS(OPA1CON2,6)
// OPA1CON1<OPA1NSS0>
extern volatile __bit                   OPA1NSS0            __at(0x900);	// @ (0x120 * 8 + 0)
#define                                 OPA1NSS0_bit        _BIT_ACCESS(OPA1CON1,0)
// OPA1CON1<OPA1NSS1>
extern volatile __bit                   OPA1NSS1            __at(0x901);	// @ (0x120 * 8 + 1)
#define                                 OPA1NSS1_bit        _BIT_ACCESS(OPA1CON1,1)
// OPA1CON1<OPA1NSS2>
extern volatile __bit                   OPA1NSS2            __at(0x902);	// @ (0x120 * 8 + 2)
#define                                 OPA1NSS2_bit        _BIT_ACCESS(OPA1CON1,2)
// OPA1CON4<OPA1OFCSEL0>
extern volatile __bit                   OPA1OFCSEL0         __at(0x918);	// @ (0x123 * 8 + 0)
#define                                 OPA1OFCSEL0_bit     _BIT_ACCESS(OPA1CON4,0)
// OPA1CON4<OPA1OFCSEL1>
extern volatile __bit                   OPA1OFCSEL1         __at(0x919);	// @ (0x123 * 8 + 1)
#define                                 OPA1OFCSEL1_bit     _BIT_ACCESS(OPA1CON4,1)
// OPA1CON4<OPA1OFCST>
extern volatile __bit                   OPA1OFCST           __at(0x91A);	// @ (0x123 * 8 + 2)
#define                                 OPA1OFCST_bit       _BIT_ACCESS(OPA1CON4,2)
// OPA1OFFSET<OPA1OFFSET0>
extern volatile __bit                   OPA1OFFSET0         __at(0x928);	// @ (0x125 * 8 + 0)
#define                                 OPA1OFFSET0_bit     _BIT_ACCESS(OPA1OFFSET,0)
// OPA1OFFSET<OPA1OFFSET1>
extern volatile __bit                   OPA1OFFSET1         __at(0x929);	// @ (0x125 * 8 + 1)
#define                                 OPA1OFFSET1_bit     _BIT_ACCESS(OPA1OFFSET,1)
// OPA1OFFSET<OPA1OFFSET2>
extern volatile __bit                   OPA1OFFSET2         __at(0x92A);	// @ (0x125 * 8 + 2)
#define                                 OPA1OFFSET2_bit     _BIT_ACCESS(OPA1OFFSET,2)
// OPA1OFFSET<OPA1OFFSET3>
extern volatile __bit                   OPA1OFFSET3         __at(0x92B);	// @ (0x125 * 8 + 3)
#define                                 OPA1OFFSET3_bit     _BIT_ACCESS(OPA1OFFSET,3)
// OPA1OFFSET<OPA1OFFSET4>
extern volatile __bit                   OPA1OFFSET4         __at(0x92C);	// @ (0x125 * 8 + 4)
#define                                 OPA1OFFSET4_bit     _BIT_ACCESS(OPA1OFFSET,4)
// OPA1OFFSET<OPA1OFFSET5>
extern volatile __bit                   OPA1OFFSET5         __at(0x92D);	// @ (0x125 * 8 + 5)
#define                                 OPA1OFFSET5_bit     _BIT_ACCESS(OPA1OFFSET,5)
// OPA1OFFSET<OPA1OFFSET6>
extern volatile __bit                   OPA1OFFSET6         __at(0x92E);	// @ (0x125 * 8 + 6)
#define                                 OPA1OFFSET6_bit     _BIT_ACCESS(OPA1OFFSET,6)
// OPA1OFFSET<OPA1OFFSET7>
extern volatile __bit                   OPA1OFFSET7         __at(0x92F);	// @ (0x125 * 8 + 7)
#define                                 OPA1OFFSET7_bit     _BIT_ACCESS(OPA1OFFSET,7)
// OPA1HWC<OPA1OREN>
extern volatile __bit                   OPA1OREN            __at(0x927);	// @ (0x124 * 8 + 7)
#define                                 OPA1OREN_bit        _BIT_ACCESS(OPA1HWC,7)
// OPA1HWC<OPA1ORPOL>
extern volatile __bit                   OPA1ORPOL           __at(0x923);	// @ (0x124 * 8 + 3)
#define                                 OPA1ORPOL_bit       _BIT_ACCESS(OPA1HWC,3)
// OPA1ORS<OPA1ORS0>
extern volatile __bit                   OPA1ORS0            __at(0x930);	// @ (0x126 * 8 + 0)
#define                                 OPA1ORS0_bit        _BIT_ACCESS(OPA1ORS,0)
// OPA1ORS<OPA1ORS1>
extern volatile __bit                   OPA1ORS1            __at(0x931);	// @ (0x126 * 8 + 1)
#define                                 OPA1ORS1_bit        _BIT_ACCESS(OPA1ORS,1)
// OPA1ORS<OPA1ORS2>
extern volatile __bit                   OPA1ORS2            __at(0x932);	// @ (0x126 * 8 + 2)
#define                                 OPA1ORS2_bit        _BIT_ACCESS(OPA1ORS,2)
// OPA1ORS<OPA1ORS3>
extern volatile __bit                   OPA1ORS3            __at(0x933);	// @ (0x126 * 8 + 3)
#define                                 OPA1ORS3_bit        _BIT_ACCESS(OPA1ORS,3)
// OPA1ORS<OPA1ORS4>
extern volatile __bit                   OPA1ORS4            __at(0x934);	// @ (0x126 * 8 + 4)
#define                                 OPA1ORS4_bit        _BIT_ACCESS(OPA1ORS,4)
// OPA1CON2<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x908);	// @ (0x121 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON2,0)
// OPA1CON2<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x909);	// @ (0x121 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON2,1)
// OPA1CON2<OPA1PCH2>
extern volatile __bit                   OPA1PCH2            __at(0x90A);	// @ (0x121 * 8 + 2)
#define                                 OPA1PCH2_bit        _BIT_ACCESS(OPA1CON2,2)
// OPA1ORPPS<OPA1PPS0>
extern volatile __bit                   OPA1PPS0            __at(0x13B0);	// @ (0x276 * 8 + 0)
#define                                 OPA1PPS0_bit        _BIT_ACCESS(OPA1ORPPS,0)
// OPA1ORPPS<OPA1PPS1>
extern volatile __bit                   OPA1PPS1            __at(0x13B1);	// @ (0x276 * 8 + 1)
#define                                 OPA1PPS1_bit        _BIT_ACCESS(OPA1ORPPS,1)
// OPA1ORPPS<OPA1PPS2>
extern volatile __bit                   OPA1PPS2            __at(0x13B2);	// @ (0x276 * 8 + 2)
#define                                 OPA1PPS2_bit        _BIT_ACCESS(OPA1ORPPS,2)
// OPA1ORPPS<OPA1PPS3>
extern volatile __bit                   OPA1PPS3            __at(0x13B3);	// @ (0x276 * 8 + 3)
#define                                 OPA1PPS3_bit        _BIT_ACCESS(OPA1ORPPS,3)
// OPA1ORPPS<OPA1PPS4>
extern volatile __bit                   OPA1PPS4            __at(0x13B4);	// @ (0x276 * 8 + 4)
#define                                 OPA1PPS4_bit        _BIT_ACCESS(OPA1ORPPS,4)
// OPA1ORPPS<OPA1PPS5>
extern volatile __bit                   OPA1PPS5            __at(0x13B5);	// @ (0x276 * 8 + 5)
#define                                 OPA1PPS5_bit        _BIT_ACCESS(OPA1ORPPS,5)
// OPA1CON3<OPA1PSS0>
extern volatile __bit                   OPA1PSS0            __at(0x910);	// @ (0x122 * 8 + 0)
#define                                 OPA1PSS0_bit        _BIT_ACCESS(OPA1CON3,0)
// OPA1CON3<OPA1PSS1>
extern volatile __bit                   OPA1PSS1            __at(0x911);	// @ (0x122 * 8 + 1)
#define                                 OPA1PSS1_bit        _BIT_ACCESS(OPA1CON3,1)
// OPA1CON4<OPA1PTRES>
extern volatile __bit                   OPA1PTRES           __at(0x91C);	// @ (0x123 * 8 + 4)
#define                                 OPA1PTRES_bit       _BIT_ACCESS(OPA1CON4,4)
// OPA1CON1<OPA1RESON>
extern volatile __bit                   OPA1RESON           __at(0x903);	// @ (0x120 * 8 + 3)
#define                                 OPA1RESON_bit       _BIT_ACCESS(OPA1CON1,3)
// OPA1CON0<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x8FB);	// @ (0x11F * 8 + 3)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON0,3)
// OPA2CON0<OPA2CPON>
extern volatile __bit                   OPA2CPON            __at(0x93D);	// @ (0x127 * 8 + 5)
#define                                 OPA2CPON_bit        _BIT_ACCESS(OPA2CON0,5)
// OPA2CON0<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x93F);	// @ (0x127 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON0,7)
// OPA2CON3<OPA2FMS0>
extern volatile __bit                   OPA2FMS0            __at(0x956);	// @ (0x12A * 8 + 6)
#define                                 OPA2FMS0_bit        _BIT_ACCESS(OPA2CON3,6)
// OPA2CON3<OPA2FMS1>
extern volatile __bit                   OPA2FMS1            __at(0x957);	// @ (0x12A * 8 + 7)
#define                                 OPA2FMS1_bit        _BIT_ACCESS(OPA2CON3,7)
// OPA2CON1<OPA2GSEL0>
extern volatile __bit                   OPA2GSEL0           __at(0x944);	// @ (0x128 * 8 + 4)
#define                                 OPA2GSEL0_bit       _BIT_ACCESS(OPA2CON1,4)
// OPA2CON1<OPA2GSEL1>
extern volatile __bit                   OPA2GSEL1           __at(0x945);	// @ (0x128 * 8 + 5)
#define                                 OPA2GSEL1_bit       _BIT_ACCESS(OPA2CON1,5)
// OPA2CON1<OPA2GSEL2>
extern volatile __bit                   OPA2GSEL2           __at(0x946);	// @ (0x128 * 8 + 6)
